const data = [
  {
    desc: `<p style="">
        النوم في الموعد نفسه كل ليلة، فهذا الأمر يساعد على تثبيت الساعة البيولوجية لديك مما يؤدي بالشعور بالاسترخاء والنعاس في الموعد نفسه يوميًّا والاستيقاظ في الموعد المحدد.</p>
        `,
    img: "1",
  },
  {
    desc: `<p style="">
        ممارسة بعض تمارين اليوجا البسيطة، ويوجد العديد من الڤيديوهات للمبتدئين التي يمكنك الاستعانة بها حيث أنها تساعد على الاسترخاء.</p>
        `,
    img: "2",
  },
  {
    desc: `<p style="">
        تجنب تناول المهدئات أو الأقراص المنومة عند الشعور بالأرق عوضًا عن ذلك تناول مكملات المغنيسيوم، حيث تعزز النوم بشكل أفضل، وتساعد على استرخاء العضلات.</p>
        `,
    img: "3",
  },
  {
    desc: `<p style=""> الماء فور الاستيقاظ أن تشرب كوبا كبيرا من الماء فور الاستيقاظ في الصباح لتعويض الجفاف أثناء النوم.</p>`,
    img: "4",
  },
  {
    desc: `<p style="">
        البروتين في الفطور&nbsp;
        سواء كان ف الفطور من الزبادي أو الشوفان فأضف البروتين، تناوله صباحًا يساعد في الحفاظ علي استقرار نسبة السكر في الدم.</p>
        `,
    img: "5",
  },
  {
    desc: `<p style="">
        أضف الفاصوليا و عالج الكربوهيدرات&nbsp;
        &nbsp;إضافة نصف كوب من الفاصوليا والخضراوات المعلبة بعد شطفها إلي أي طعام علي الغذاء أو العشاء يوميا فهي العامل الغذائي المشترك بين الأشخاص الذين يعيشون حياة أطول و أكثر خلوًا من الأمراض.</p>
        `,
    img: "6",
  },
  {
    desc: `<p style="">
        حافظ علي بشرتك&nbsp;
        خذ دقيقة كل صباح لوضع واقي الشمس كي لا تكون عُرضة للعديد من انواع سرطان الجلد.</p>
        `,
    img: "7",
  },
  {
    desc: `<p style="">
        ا يكفي أن تغسل يديك لمدة ٢٠ ثانية لكنك تحتاج إلي ٢٠ ثانية أخري لتجفيف يديك بشكل صحيح فالأيدي المبللة أكثر عرضة للجراثيم.</p>
        `,
    img: "8",
  },
  {
    desc: `<p style="">
        تنفّس بعمق&nbsp;
        جرّب أن تأخذ نفسين إلي ٣ أنفاس عميقة و أثناء التركيز فكّر في ٣ أشياء تسير علي ما يُرام بالنسبة لك أو في الاشياء التي تتطلع إليها في المستقبل القريب ثم دوّنها.</p>
        `,
    img: "9",
  },
  {
    desc: `<p style="">
        اخفض الأضواء و الحرارة
        لتحسين صحتك قم بتخفيف الأضواء بعد غروب الشمس فهذا يساهم في تعزيز إنتاج هرمون الميلاتونين الذي له تأثير مهدّي يجعلك تنام أسرع.</p>
        `,
    img: "10",
  },
  {
    desc: `<p style="">
        المشي لتقوية القلب&nbsp;
        بعد المشي يوميًا بين ١٥ و ٣٠ دقيقة من أكثر الطرق فعالية للوقاية من أمراض القلب لذلك يمكن أن تخصص بعض الوقت صباحًا ومساءًا لتخفيف التوتر والإجهاد.</p>
        `,
    img: "11",
  },
  {
    desc: `<p style="">
        القيام بالفحوصات
        يشمل ذلك تحليل الدم والبول والفحوصات بالموجات فوق الصوتية للقلب والغدة الدرقية والبطن والحوض والتأكد من سلامة العيون والأسنان وللنساء فحوصات إضافية لدي طبيب الأمراض النسائية.</p>
        `,
    img: "12",
  },
  {
    desc: `<p style="">
        نظف أسنانك&nbsp;
        خصص ٣٠ ثانية لاستخدام الخيط لتخليص أسنانك من البكتريا الكامنة حيث تتجمع بقايا الطعام مسببة الكثير من المشاكل الصحية و ٣٠ ثانية أخري لغسل الفم بغسول طبي.</p>
        `,
    img: "13",
  },
  {
    desc: `<p style="">
        دقائق للتأمل يوميًا&nbsp;
        يعتبر التأمل أحد أفضل الطرق للتعامل مع التوتر اليومي وتخفيف وطأته وتأثيراته السلبية و يزيد أيضا من إفراز الجسم لهرمون الاوكسيتوسين الذي له دور مقاوم للاكتئاب.
        </p>
        `,
    img: "14",
  },
  {
    desc: `<p style="">
    تناول الطعام الصحي&nbsp;
    يجب أن يكون النظام الغذائي صحي ومتنوع الفواكه والخضراوات محتواها من الألياف يعطي إحساس بالشبع و يحسن من الهضم.</p>
    `,
    img: "15",
  },
  {
    desc: `<p style="">
    تجنب المنبهات&nbsp;
    الاكتفاء بفنجان قهوة واحد يوميًا او استبداله بكوب من الشاي الأخضر لأنها تزيد من مستوي هرمون الكورتيزون أو هرمون التوتر.</p>
    `,
    img: "16",
  },
];


const html = data.map((d, i) => {
    return `
    <div class="d-block d-md-flex justify-content-between mb-2-5 mb-md-2-9">
    <div class="left-side">
        <h3 class="display-21 display-sm-16 display-md-14 display-lg-12 mb-0 text-primary"></h3>
    </div>
    <div class="right-side">
        <h4 class="mb-3 ">
         العادة ${i + 1}
        </h4>
        <p class="mb-4">
        ${d.desc}
        </p>
        <img src="../img/جسدية-عادات/${d.img}.jpg" class="border-radius-10" alt="...">
    </div>
</div>
    `
});


window.onload = () => {
    document.getElementById('dataWrapper').innerHTML = (html);
}