const books = [
    {
        title: 'اقرا الناس كأنهم كتاب',
        desc: `اقرأ الناس كأنهم كتاب 
-  بيساعد ع التعرف ع الحيل التي تساعدك ع كشف افكار الاخرين . 
-  اكتشف لغة الجسد وطرق تحليل الكلام لتعرف ما يخفيه الاخرون . 
-  تعلّم طرق التعرف ع شخصيات الناس وتحليل شخصيتهم . 
-  تعرف ع طرق جديدة لاكتشاف الكذب وطرق الحصول ع المعلومات . 
في الكتاب هنعرف كل الاسرار التي تمكننا من فهم الناس وكشف الكاذبين وقراءة العقول والافكار`,
        img: '1'
    },
    {
        title: 'فن الكلام',
        desc: `فن الكلام 
كتاب شيق ومهم جدًا .. 
- كتاب رائع عن مهارات الكلام وفن التواصل وأسلوب الحوار الناجح 
- هل فكرت كيف يمكنك أن تدير مقابلة عمل سليمة، كيف تدير الحوار مع أصدقائك، كيف تتفاوض مع زبائنك وفريق عملك ، كيف تعبر عن نفسك أو حتى أن تختلف في الرأي وتعبر عن ذلك بطريقة تضيف لوجهة نظرك . 
- إذا كنت شخص طموح في حياتك العملية والإجتماعية، فان أول طريق النجاح يبدأ بالإدارة، وأول طرق الإدارة يبدأ بمهارات الإتصال.. ومهارات الاتصال كما نسيمها بالعامية: فن الكلام`,
        img: '2'
    },
    {
        title: 'فن التعامل مع الناس',
        desc: `فن التعامل مع الناس 

إن معاملة الناس ليس بالشيء السهل بل هو فن كما قال عنه كاتب العلاقات الإنسانية  “ديل كارنيجى فى كتابه “فن التعامل مع الناس” فكل إنسان له طبائع تختلف عن غيره ، والإنسان يحتاج إلى خبرات حتى يتكيف مع طبائع الغير ويكون قادر علي خوض تجارب مع الناس ، فيقدم لنا ديل كارنيجى فى كتابه "فن التعامل مع الناس" 10 نصائح حتى تستطيع أن تتعامل مع الناس بسهولة دون مشاكل .. وهذه النصائح هى:
-لا تتعجل فى محاسبة الناس.
-ما هو السر الأعظم فى معاملة الناس.
-لا تنصح ، لا تعظ ، ولا تتحدث عما تريده.
-كن موضع إعجاب من الناس ولا تطلب مقابل.
-توسل بالرفق واللين واترك الغضب والعنف.
-التعاون سبيل النجاح.
-دع الشخص الآخر يحتفظ بماء وجهه.
-اعرف نفسك وكن نفسك.
-بقدر أهميتك يكون النقد الموجه إليه.
-استرخ قدر الإمكان.`,
        img: '3'
    },
    {
        title: 'فن التأثير في الاخرين',
        desc: `فن التأثير في الآخرين
هذا الكتاب يكشف لك سر الروابط القوية التي تجمع الناس ببعضهم البعض، ويقدم لك الطرق التي تجعل منك شخصًا محبوبًا في أي مكان..
– هل تتسائل لما يتجنب الناس أشخاص بعينهم ويميلون إلى أشخاص أخرين؟
– هل ترغب في معرفة المعنى الحقيقي للكاريزما واكتساب محبة الغير؟
كلها تساؤلات تدور في عقولنا جميعًا ويبقى السؤال هنا ما سر انجذاب الناس لبعضهم البعض في الأساس؟
في هذا الكتاب محاولة عملية تساعدك على إعادة النظر في علاقاتك وعلى اكتشاف سر المحبة والإعجاب والقبول في كل الدوائر الاجتماعية التي تنتمي إليها، سواء في المنزل أو العمل أو أي مكان تذهب إليه . 
توقف عن الشعور بأنك منعزلًا عن العالم وتعلم كيفية اكتساب ثقة من تحبهم ولفت أنظار الجميع وكسب احترامهم وودّهم ، ستمتلك القوة الكافية للتعبير عما يدور في عقلك ولكن بأكثر الطرق ذكاءً وجاذبية.`,
        img: '4'
    },
    {
        title: 'فن قراءه العقول',
        desc: `فن قراءة العقول

هل تريد أن تعرف ما يفكر فيه الناس من حولك؟ هل ترغب في تكوين شبكة علاقات ناجحة؟ الآن يمكنك ذلك مع خبرة «هينريك فيكسيوس» .  
-يعلمك كتاب “فن قراءة العقول” كل ما تحتاج معرفته لتصبح خبيرًا في قراءة الأفكار باستخدام المهارات القائمة على علم النفس، مثل التواصل غير اللفظي، وقراءة لغة الجسد، واستخدام التأثير النفسي. 
 - يشرح ايضا كيف يمكن للقراءة معرفة ما يفكر فيه الشخص الآخر، وما يشعر به، وبالتالي التحكم في أفكار هذا الشخص ومعتقداته . 
-تغطي فصول الكتاب مواضيع تتعلق بكيفية فهم السلوك البشري ، والتأثير فيه، وكيف تقوم بنقل أفكارك للآخرين دون أن يلاحظوا ذلك. 
-يقدم فيكيسوس: للقراءة أمثلة عملية حول كيفية قراءة أفكار الآخرين، بشكل فعال وكيفية  استخدام كل هذه المهارات بأسلوب سلس وطريقة مشوقة`,
        img: '5'
    },
    {
        title: '24 ساعه صحه',
        desc: `في صفحات هذا الكتاب ستجد الدافع والطريقة الصحيحة لتغيير جسدك وصحتك النفسية بطريقة سهلة.

أكثر من 20 عادة استثنائية ستُغيّر حياتك وتجعلك أسعد وأكثر نشاطًا وقدرة على التحمّل.
في كتاب 24 ساعة صحة
- تعرّف على الطريقة المثالية لمَنح جسدك كل ما يحتاجه، والحفاظ على النمط السليم لحياتك.
- اكتشف الأوقات المناسبة للنوم والعادات الصحية اللازمة في الصباح وفي نهاية كل يوم.
- امتلك الفرصة في خلق روتين يومي يضمن لك صحة أفضل ونفسيّة أكثر اتزانًا.
- اعرف أسباب الحزن والاكتئاب وما الفارق بينهما، وكيف يمكنك التغلب على تلك العراقيل النفسية كي تعيش الحياة التي تستحقها.
- اقرأ عن أكثر الأطعمة المفيدة لجهاز المناعة، الأطفال باختلاف أعمارهم، مرضى السكر، الضغط، القلب، وكل الحالات الاستثنائية التي تحتاج لرعاية خاصة.
- اعرف أكثر عن السمنة، مفهوم السمنة الموضعية، وعلاقة الطعام بحالتك ا…`,
        img: '6'
    },
    {
        title: 'فن الامبالاه',
        desc: `نبذة عن كتاب فن الامبالاه :

كتاب فن اللامبالاة هو كتاب في التنمية البشرية تقوم فكرة الكتاب على أهمية تقبل الفشل والألم والتعايش مع الواقع فالواقع هو  المفتاح الرئيسي لحياة سعيدة وثرية وليس التفكير الإيجابي وينصحنا الكاتب مارك مانسون بأن نعرف حدود إمكانياتنا وأن نتقبلها وأن ندرك مخاوفنا ونواقصنا وأن نكف عن التهرب من ذلك كله ونبدأ بمواجهة الحقائق الموجعة حتى نصبح قادرين على أن نجد ما نبحث عنه من جرأة ومثابرة وصدق وحب للمعرفة فيرفض الكاتب فكرة أن تكون دائمًا إيجابيًا .`,
        img: '7'
    },
    {
        title: 'العادات السبع الأكثر فاعلية',
        desc: `نبذه عن كتاب العادات السبع للناس الاكثر فاعليه : 
الكتاب يتعرض لسبع مبادئ، إذا طبقت كعادات فإنها من المفترض أن تساعد الشخص على أن يكون أكثر فعالية والكاتب ستيفن كوفي يؤكد أنه يمكن تحقيق ذلك عن طريق مواءمة النفس إلى ما يسميه «بالبوصلة الداخلية باتجاه الشمال» على أساس المبادئ الأساسية للأخلاقيات والطابع .`,
        img: '8'
    },
    {
        title: 'فن التعامل مع الناس',
        desc: `ملخص كتاب " فن التعامل مع الناس "
التعامل مع الناس هو فن يحتاج إلى الكثير من الخبرة حتى يستطيع الفرد أن يتكيف مع غيره من الأفراد الذين يختلفون في الطبائع وفي السمات الشخصية.
ومن أهم النصائح التي جاءت فى الكتاب : 
‏1- أحصل على قدر من الراحة
2- لا تنزعج من توجيه النقد إليك 
3- صاحب نفسك وكن أنت 
4- حافظ على كرامة الشخص المهزوم أمامك
5- إجعل العمل الجماعي سراً لنجاحك
6- تخلى عن غضبك وتميز باللين والرفق  
‏7- لا تقوم بموعظة أحد
8- لا تحاسب الناس`,
        img: '9'
    },
]