const sys = [
  {
    title: "الكيتو دايت",
    desc: `يعد نظام الكيتو دايت من أشهر أنواع أنظمة التخسيس التي تعتمد بشكل أساسي على تقليل كمية الكربوهيدرات في الجسم والاكثار من تناول الدهون ليكون عوضا عن نقص الكربوهيدرات في الجسم.
واكثر الأشخاص استخداما لنظام "الكيتو" هم الأشخاص الذين يعانون من السمنة المفرطة حيث يساعد هذا النظام على إنقاص الوزن حسب العديد من الدراسات التي اقيمت حوله، كما يقوم بخفض الشهية، مما يؤدي إلى انخفاض في تناول السعرات الحرارية ويقلل من ارتفاع مستوى الكوليسترول في الدم.
الجانب السلبي لنظام الكيتو : لكل نظام غذائي فوائد وسلبيات رغم فوائد تلك النظام إلا أنه لا يناسب الجميع خصوصًا لأصحاب الأمراض المزمنة فهو يعد نظام قاسي على أصحاب تلك الأمراض.`,
  },
  {
    title: "نظام دوكان الغذائي",
    desc: `هو نظام غذائي يعتمد على تقليل الكربوهيدرات، وينقسم إلى أربع مراحل، مرحلتان لفقدان الوزن في بدايته ومرحلتان للاستمرار فيما بعد فيما يعرف بـ تثبيت الوزن وتعتمد مراحل إنقاص الوزن على تناول عدد كبير جدًا من الأطعمة الغنية بالبروتين بشكل أساسي.
فوائد نظام الدوكان : لا يوجد فوائد لنظام الدوكان  غير إنقاص الوزن فقط، حسب الدراسات التي أجريت على النظام.`,
  },
  {
    title: "الصيام المتقطع",
    desc: `يعد نظام الصيام المتقطع من أفضل أنواع الرجيم التي تنظم جسمك بين فترات الصيام والأكل ويساعد بشكل كبير في إنقاص الوزن.
من أكثر الطرق شيوعًا لأداء الصيام المتقطع :
أ: هي طريقة 16/8 : وهى تتضمن عدم تناول وجبة الإفطار وتقييد فترة تناول الطعام إلى ثماني ساعات يوميًا، وبالتالي ستصوم لمدة 16 ساعة وهي المتبقية من اليوم، والصيام لمدة 24 ساعة مرة أو مرتين في الأسبوع ولكن في أيام مختلفة أي غير متتالية.
ب: نظام المحارب الغذائي: وهو عبارة عن تناول كميات صغيرة من الفاكهة والخضروات النيئة أثناء النهار، وتناول ووجبة كبيرة في الليل.
فوائد أخرى: يقلل الصيام المتقطع من الاصابة بالتهابات وارتفاع الكوليسترول والدهون الثلاثية وسكر الدم.
الجانب السلبي: الصيام المتقطع قد لا يناسب الجميع فهو يحتاج إلى من يتمتع بصحة جيدة فقط.`,
  },
];

const sysHtml = sys.map((e, i) => {
  return `
    <div class="card">
    <h2 class="card-header" id="heading${i}">
        <button class="accordion-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapse${i}" aria-expanded="false" aria-controls="collapse${i}">
        ${e.title}</button>
    </h2>
    <div id="collapse${i}" class="accordion-collapse collapse " aria-labelledby="heading${i}" data-bs-parent="#accordion">
        <div class="card-body">
           ${e.desc}
        </div>
    </div>
</div>
    `;
});


// for diseases
const ghodaDaraqia = [
  {
      title: 'الحبوب الكاملة',
      desc: `بما أن فرط نشاط الغدة الدرقية يؤدي إلى الإمساك الشديد، فإن الحل الأمثل لتجنب ذلك هو الإكثار من تناول الأطعمة الغنية بالألياف. لذا ينصح بالمواظبة على تناول الحبوب الكاملة مثل الأرز البني، الشوفان والكينوا.`
  },
  {
      title: 'الفاصوليا الجافة',
      desc: `غالباً ما يعاني مرضى فرط نشاط الغدة الدرقية من الشعور بالتعب المستمر، لذا ينصح بتناول الفاصوليا الجافة لأنها تساعد في احتفاظ الجسم بالطاقة، فهي مصدر غني بمضادات الأكسدة، الفيتامينات، المعادن والبروتينات، ما يجعلها فعّالة في مثل هذه الحالات.`
  },
  {
      title: 'الأسماك',
      desc: `لاحتوائها على الأحماض الدهنية الأساسية، تعتبر الأسماك بمثابة علاج طبيعي لفرط نشاط الغدة الدرقية، خاصة سمك السلمون، سمك السلمون المرقط، والسردين والتونة وذلك لاحتوائهم على كميات وفيرة من أحماض أوميغا 3 الدهنية التي تساعد في الحد من الالتهابات، وتقوي مناعة الأشخاص الذين يعانون من فرط نشاط الغدة الدرقية.`
  },
  {
      title: 'الخضراوات والفواكه',
      desc: `تساعد الفواكه والخضراوات الغنية بالمواد المضادة للأكسدة في تطهير الجسم من السموم، كما أنها تدعم عمل الغدة الدرقية، وتساعد على التحكم في زيادة الوزن.`
  },
  {
      title: 'المكسرات',
      desc: `من أعراض فرط نشاط الغدة الدرقية، زيادة الشهية، لذا فإن تناول المكسرات، خاصة الجوز يمكن أن يحل هذه المشكلة، فهو يعطي إحساسا بالشبع يدوم لفترة. 
كما أنها مصدر رئيسي من مصادر مادة السيلنيوم المضادة للأكسدة والتي تفيد بشكل كبير مرضى فرط نشاط الغدة الدرقية.`
  },
  {
    title: 'الأطعمة الغنية بالدهون غير المشبعة',
    desc: `يتعين على مرضى فرط نشاط الغدة الدرقية الابتعاد عن الأطعمة الدهنية الغنية بالدهون غير المشبعة والأحماض الدهنية المشبعة، لأنها تقلل من قدرة الجسم على امتصاص الهرمونات الدرقية، كما أنها تؤثر على مستويات إنتاج الغدة الدرقية للهرمونات.`
},
{
    title: 'الكافيين',
    desc: `يؤثر الكافيين على امتصاص الأدوية في الأمعاء، ما يعوق تنظيم إفرازات الغدة الدرقية.`
},
{
    title: 'الخضراوات الكرنبية أو الخردلية',
    desc: `ؤثر الخضراوات الكرنبية مثل القرنبيط، البروكلي، اللفت والملفوف، سلباً على سير عمل الغدة الدرقية. 
كما أنها يمكن أن تؤثر على قدرة الغدة على امتصاص اليود، وهو أمر مهم جداً لضمان عمل الغدة الدرقية بشكل طبيعي.`
},
{
    title: 'الصويا',
    desc: `تحتوي أطعمة الصويا على مادة فيتويستروغنز التي تعرقل عمل أنزيم الغدة الدرقية، والذي يشكل هرمونها، هذا بالإضافة إلى أن تناول الصويا يزيد من فرص الإصابة بفرط نشاط الغدة الدرقية.`
},
{
    title: 'الأطعمة المصنعة',
    desc: `الكميات الكبيرة من الصوديوم والموجودة في الأطعمة المصنعة تضر مرضى فرط نشاط الغدة الدرقية بشكل كبير وتجعلهم أكثر عرضة لخطر الإصابة.`  

}
];

const Anemia = [
  {
      title: 'السبانخ',
      desc: `السبانخ من الخضروات الورقية الداكنة، وهي مصدر جيد للحديد والبوتاسيوم والفيتامينات K و B.
والسبانخ ليست جيدة فقط لنقص الحديد ولكنها تحتوي أيضًا على فيتامين C ، الذي يعزز امتصاص الحديد في الجسم، كما أنها غنية بمضادات الأكسدة التي تسمى الكاروتينات التي تحسن صحتك عن طريق تقليل الالتهاب وزيادة مستويات المناعة، كما أنها مصدر غني جدًا بالحديد ويمكن استهلاكه بأشكال مختلفة.`
  },
  {
      title: 'اللحوم',
      desc: `اللحوم مغذية للغاية، وخاصة لحوم الكبد والكلى والدماغ والقلب، لأنها غنية بفيتامينات ب والنحاس والسيلينيوم. ووجود الحديد والألياف المنخفضة خاصة في اللحوم الحمراء يمكن أن يعالج فقر الدم ويزيد مستويات الهيموجلوبين.`
  },
  {
      title: 'البقوليات',
      desc: `أكثر أنواع البقوليات شيوعًا هي الفول والعدس والحمص وفول الصويا والبازلاء. والبقوليات هي أيضًا مصدر كبير لحمض الفوليك والمغنيسيوم والبوتاسيوم.. إنها تساعد في تلبية احتياجات الجسم من الحديد، خاصة للأشخاص الذين لا يرغبون في تناول اللحوم.`
  },
  {
      title: 'المكسرات والفواكه المجففة',
      desc: `المكسرات مثل التمر والزبيب والجوز واللوز والمشمش المجفف مليئة بالحديد والكالسيوم والمغنيسيوم، ويمكن أن تساعدك هذه المكسرات في بناء نظام مناعة قوي إلى جانب علاج فقر الدم وانخفاض مستويات الهيموجلوبين.`
  },
  {
      title: 'البروكلي',
      desc: `لتحسين امتصاص الحديد من أجل علاج فقر الدم والهيموجلوبين، فإن البروكلي هو الخيار الصحيح، حيث أن له قيمة غذائية عالية إنه ليس مفيدًا فقط لنقص الحديد ، ولكنه أيضًا نبات صليبي يحتوي على الإندول والسلفورافان والجلوكوزينولات هذه مركبات نباتية يعتقد أنها تحمي من السرطان.`
  },
  {
      title: 'السمك',
      desc: `حاول تضمين الأطعمة غير النباتية في نظامك الغذائي أيضًا الأسماك ، وخاصة التونة ، غنية بالحديد وأحماض أوميجا 3 الدهنية التي تعزز صحة الدماغ والقلب وتدعم وظيفة المناعة.`
  },
  {
      title: 'البذور',
      desc: `تعتبر البذور مثل اليقطين والسمسم والكتان من أفضل مصادر الحديد، كما أنها تحتوي على كميات جيدة من البروتين النباتي والألياف والكالسيوم والمغنيسيوم والزنك والسيلينيوم ومضادات الأكسدة ومركبات نباتية مفيدة أخرى أيضًا.
بالإضافة إلى ذلك ، تعد البذور أيضًا مصدرًا رائعًا لأحماض أوميجا 3 وأوميجا 6 الدهنية ، مما يجعلها غذاءً مثاليًا لمحاربة فقر الدم وانخفاض مستويات الهيموجلوبين.`
  
}
];
const bloodPressure = [
  {
      title: 'الإكثار من تناول الملح',
      desc: `الأنظمة الغذائية منخفضة الصوديوم ليست فكرة جيدة لمن يعانون من ضغط الدم المنخفض، إذ يُنصح الأفراد الذين يعانون من انخفاض ضغط الدم زيادة الملح في وجباتهم اليومية بشكل معتدل للمساعدة في رفع ضغط الدم.`
  },
  {
      title: 'تناول وجبات صغيرة خلال اليوم',
      desc: `قد يساعد الحصول على وجبات صغيرة ومتكررة على مدار اليوم في علاج انخفاض ضغط الدم بالغذاء، لذلك اختر الوجبات الصحية والمفيدة لصحتك`
  },
  {
      title: 'الأطعمة الغنية بفيتامين ب12',
      desc: `تساعد الأطعمة الغنية بفيتامين ب12، مثل: البيض، واللحوم، ومنتجات الألبان، وحبوب الإفطار المدعمة، وبعض منتجات الخميرة الغذائية في رفع ضغط الدم المنخفض`
  },
  {
      title: 'الأطعمة الغنية بحمض الفوليك',
      desc: `إن الأطعمة المحتوية على نسبة عالية من حمض الفوليك، مثل: الخضار الورقية الخضراء، والفواكه، والمكسرات، والفاصوليا، والبيض، ومنتجات الألبان، واللحوم، والدواجن، والمأكولات البحرية، والحبوب جيدة لرفع ضغط الدم.`
  },
  {
      title: 'الأطعمة والمشروبات التي تحتوي على مادة الكافيين',
      desc: `تسبب الأطعمة والمشروبات التي تحتوي على الكافيين ارتفاعًا في ضغط الدم، إذ وجد أن القهوة ترفع ضغط الدم مؤقتًا فقط لدى الأشخاص الذين لا يشربونها بانتظام، وتشمل الأطعمة والمشروبات الأخرى التي تحتوي على الكافيين: الشوكولاته، والشاي، والكاكاو، وبعض المشروبات الغازية، ومشروبات الطاقة.﻿ `

  }
];
const eyeHealth = [
  {
      title: 'السمك',
      desc: `نظرا لأن الأسماك غنية بأحماض أوميغا 3 الدهنية، فيمكن أن تساعد في الحفاظ على صحة شبكية العين وتحسين البصر.`
  },
  {
      title: 'البيض',
      desc: `صفار البيض مليء بالفيتامينات للحفاظ على البصر في حالة جيدة. ويحتوي صفار البيض النموذجي على العناصر الغذائية التالية المفيدة للعين:

- فيتامين A
- اللوتين
- الزياكسانثين
- الزنك
ويحمي فيتامين A القرنية بينما يمكن أن يقلل اللوتين والزياكسانثين من خطر الإصابة بالتنكس البقعي أو الغلوكوما.
ومن المعروف أن الزنك هو مفتاح الرؤية بشكل أفضل في الليل، أو عندما تكون الأضواء منخفضة.`
  },
  {
      title: 'الجزر',
      desc: `يشتهر الجزر بتحسين البصر، وهو طعام رائع لتناوله إذا كنت ترغب في تعزيز رؤيتك.
ويحتوي الجزر على مستويات عالية من فيتامين A وبيتا كاروتين، وكلاهما سيساعد في الحفاظ على صحة العينين.
وأحد أعراض نقص فيتامين A هو العمى الليلي، لذا فإن تناول الجزر يمكن أن يساعدك على تجنب ذلك، لكنه لن يمنحك رؤية ليلية خارقة للطبيعة`
  },
  {
      title: 'اللوز',
      desc: `اللوز مليء بفيتامين E. وغالبا ما يُنسب هذا الفيتامين إلى جعل بشرتك ناعمة وسلسة بشكل جميل، ولكنه قد يحسن أيضا البصر ويقلل من خطر الإصابة بإعتام عدسة العين`
  },
  {
      title: 'الكالي (البروكلي الصحية)',
      desc: `غالبا ما يتم اعتباره طعاما فائقا، وهو يتمتع بالتأكيد ببعض المؤهلات الصحية الرائعة.

ويحتوي الكالي على نسبة عالية من مضادات الأكسدة بما في ذلك اللوتين والزياكسانثين والتي يمكن أن تساعد في تقليل خطر الإصابة بأمراض العين الخطيرة مثل إعتام عدسة العين والضمور البقعي.`
  },
  {
      title: 'البرتقال',
      desc: `البرتقال غني بفيتامين C الذي يملك العديد من الوظائف الهامة في الجسم.
وتتمثل إحدى وظائف فيتامين C في الحفاظ على صحة الأوعية الدموية في العين وهو أمر ضروري لصحة العينين.`

}
];
const digestiveSys= [
  {
      title: 'الحبوب الكاملة',
      desc: `غنية بالألياف ومفيدة جدًا للجهاز الهضمي، يعالجون أعراض الجهاز الهضمي مثل حرقة المعدة والغازات والغثيان تحافظ الحبوب الكاملة على حركة أمعائك بسلاسة.`
  },
  {
      title: 'الزبادي',
      desc: `يحتوي الزبادي على البكتيريا المفيدة لعملية الهضم، يجب تضمينه في نظامك الغذائي اليومي لتجنب أي مشاكل في الجهاز الهضمي.`
  },
  {
      title: 'الزنجبيل',
      desc: `تناول الزنجبيل النيء يمكن أن يعالج الإمساك،  الزنجبيل غني بالألياف المفيدة للغاية لعملية الهضم.`
  },
  {
      title: 'الموز',
      desc: `يشتهر الموز بعلاج مشاكل وأمراض المعدة مثل الإسهال، إنها مسئولة عن الأداء السلس لأمعائك إذا كنت تأكل موزة واحدة كل يوم ، فسيستمر جهازك الهضمي في العمل بشكل جيد.`
  },
  {
      title: 'البابايا',
      desc: `البابايا لها خصائص مضادة للالتهابات تعمل على تهدئة اضطراب المعدة يساعد في هضم الطعام بسهولة يسهل عملية الهضم ويعالج أعراض مثل حرقة المعدة والغازات`
  },
  {
      title: 'الخيار',
      desc: `يعد الخيار مصدرًا غنيًا بالألياف المفيدة للجهاز الهضمي يبرد معدتك ويوفر الراحة من أي أعراض أخرى في الجهاز الهضمي.`
  },
  {
      title: 'الطماطم',
      desc: `الطماطم صحية جدًا لمعدتك تحتوي على مادة الليكوبين التي تساعد في عملية الهضم. الطماطم غنية بالمغنيسيوم والألياف.`
  },
  {
      title: 'الكيوي',
      desc: `الكيوي مليء بالعناصر الغذائية المفيدة للغاية لصحة الجهاز الهضمي يحتوي على فيتامين سي والمغنيسيوم والبوتاسيوم والبيبسين وهو أمر جيد جدًا لصحة أمعائك.`
  },
  {
      title: 'التفاح',
      desc: `يضمن التفاح حسن سير الأمعاء تحتوي على بكتيريا مفيدة لصحة أمعائك، يساعد التفاح في عملية الهضم ويحافظ على صحة معدتك.`
  },
  {
      title: 'الجزر',
      desc: `الجزر مفيد جدًا لعملية الهضم. تحتوي على الألياف ومضادات الأكسدة المفيدة لصحة الجهاز الهضمي.`



  }
]
const thinness = [
  {
      title: 'الجوز (عين الجمل)',
      desc: `فهو غني بالدهون المفيدة والألياف والبروتينات. فيمكن إضافة حوالي 30 غراماً من الجوز (العين الجمل) لوجباتك اليومية للمساعدة في اكتساب الوزن، إضافة إلى أن الجوز يساعد في تحسين وظائف المخ ويقلل من مستوى الكوليستيرول السيء في الجسم.`
  },
  {
      title: 'الأجبان',
      desc: `فهي مصدر رئيسي للكالسيوم وفيتامين "B12"، وشريحة الجبن تحتوي على حوالي 100 سعرة حرارية، لذا فلمن يعاني من النحافة الشديدة، عليه بإدخال الأجبان بأنواعها المختلفة ضمن نظامه الغذائي اليومي.`
  },
  {
      title: 'المعكرونة',
      desc: `فهي من الأطعمة التي تحتوي على النشويات ويمكن أن تساعد في اكتساب بعض الوزن لاحتوائها على الكثير من السعرات الحرارية.`
  },
  {
      title: 'زبدة الفول السوداني',
      desc: `فهي غنية بالبروتينات والبوتاسيوم والدهون المفيدة للجسم، التي قد تساعد شديدي النحافة في اكتساب الوزن.`
  },
  {
      title: ' البيض',
      desc: `فطبق من البيض المخفوق يحتوي على الدهون المفيدة والسعرات العالية التي تساعد في اكتساب بعض الوزن.`
  },
  {
      title: 'الشوكولاتة الداكنة',
      desc: `فقد أثبتت الدراسات أن قطعة الشوكولاتة الداكنة يمكنها أن تساعدك في اكتساب الوزن بطريقة صحية وبدون إحداث أي أضرار صحية للجسم.`
  },
  {
      title: 'الزبادي',
      desc: `فهو من الأطعمة الغنية بالعناصر الغذائية المفيدة جداً والتي قد تساعد في اكتساب جسمك لبعض الوزن بطريقة صحية (بعيداً عن الأنواع خالية الدسم).`






  }
];

const obesity = [
  {
      title: ' الأفوكادو',
      desc: `نظرًا لاحتواء الأفوكادو على نسبة عالية من الدهون الصحية غير المُشبعة، فإنّ ذلك يُساعد على الشعور بالشبع لفترة طويلة.`
  },
  {
      title: 'السمك والمأكولات البحرية',
      desc: `تُعدّ المأكولات البحرية مصدرًا ممتازًا للعديد من العناصر الغذائية، مثل: البروتين، والدهون الصحية، والألياف، والفيتامينات والمعادن لا سيّما فيتامين د`
  },
  {
      title: 'الخضار الصليبية',
      desc: `الخضار الصليبية، مثل: البروكلي، والملفوف الأبيض والأحمر، والقرنبيط، والكرنب المُجعَّد، تحتوي على نسبة عالية من الألياف التي تُساعد على الشعور بالشبع لوقت أطول بالإضافة إلى الوقاية من الإمساك.`
  },
  {
      title: 'البطاطا',
      desc: `إنّ تناول البطاطا مسلوقة أو مشويّة ضمن نظام غذائي صحّي قد تُساعد على الشعور بالشبع وإنقاص الوزن، لكنّ البطاطا المقليّة غير محسوبة.`
  },
  {
      title: 'أصناف أخرى',
      desc: `إليكم بعض الأصناف الغذائية الأخرى التي تُساعد على الشعور بالشبع لفترات أطول بالإضافة إلى تزويد الجسم بالعناصر الغذائية المطلوبة:

البقوليّات والفاصولياء، مثل: الحمص، والفول، والعدس، والبازلاء الخضراء.
التوتيّات بأنواعها، مثل: الفراولة، والتوت البرّي، والتوت الأزرق.
البيض.
المكسرات.
الحبوب الكاملة، مثل: البرغل، والفريكة.`
}
];



const diseasCollection = [];

function makeFoodGroup(label, content) {
  diseasCollection.push({
    label: label,
    content: content
  });
  
}

makeFoodGroup('مرضى الغدة الدرقية', ghodaDaraqia);
makeFoodGroup('مرضى الأنيميا', Anemia);
makeFoodGroup('مرضى ضغط الدم', bloodPressure);
makeFoodGroup('مرضى العين', eyeHealth);
makeFoodGroup('مرضى عسر الهضم والمعدة', digestiveSys);
makeFoodGroup('مرضى الكوليسترول', thinness);
makeFoodGroup('مرضى السمنة', obesity);



const diseasHTML =  diseasCollection.map((e, i) => {


  const wasafat = e.content.map((f, fI) => {
    return `
  <div class="row g-0 justify-content-center mb-1-6 mb-md-2-2 mb-xl-2-8">
  <div class="col-md-12">
      <div class="card bg-white border rounded-3  ">
          <div class="card-body border-0 p-1-9 p-lg-2-5">
              <div class="schedule-tag">
              ${f.title}
              </div>
              <p class=" ">
              ${f.desc}
              </p>
          </div>
      </div>
  </div>
</div>
    `
  }).join('')

  return `
  <div class="card">
  <h2 class="card-header" id="heading${i+1}">
      <button class="accordion-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapse${i+1}" aria-expanded="false" aria-controls="collapse${i+1}">
       ${e.label}
      </button>
  </h2>
  <div id="collapse${i+1}" class="accordion-collapse collapse " aria-labelledby="heading${i+1}" data-bs-parent="#accordion">
      <div class="card-body bg-white">
         ${wasafat}
      </div>
  </div>
</div>
  `
 
  ;
});