const foods = [
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
];

const ghodaDaraqia = [
    {
        title: 'الحبوب الكاملة',
        desc: `بما أن فرط نشاط الغدة الدرقية يؤدي إلى الإمساك الشديد، فإن الحل الأمثل لتجنب ذلك هو الإكثار من تناول الأطعمة الغنية بالألياف. لذا ينصح بالمواظبة على تناول الحبوب الكاملة مثل الأرز البني، الشوفان والكينوا.`
    },
    {
        title: 'الفاصوليا الجافة',
        desc: `غالباً ما يعاني مرضى فرط نشاط الغدة الدرقية من الشعور بالتعب المستمر، لذا ينصح بتناول الفاصوليا الجافة لأنها تساعد في احتفاظ الجسم بالطاقة، فهي مصدر غني بمضادات الأكسدة، الفيتامينات، المعادن والبروتينات، ما يجعلها فعّالة في مثل هذه الحالات.`
    },
    {
        title: 'الأسماك',
        desc: `لاحتوائها على الأحماض الدهنية الأساسية، تعتبر الأسماك بمثابة علاج طبيعي لفرط نشاط الغدة الدرقية، خاصة سمك السلمون، سمك السلمون المرقط، والسردين والتونة وذلك لاحتوائهم على كميات وفيرة من أحماض أوميغا 3 الدهنية التي تساعد في الحد من الالتهابات، وتقوي مناعة الأشخاص الذين يعانون من فرط نشاط الغدة الدرقية.`
    },
    {
        title: 'الخضراوات والفواكه',
        desc: `تساعد الفواكه والخضراوات الغنية بالمواد المضادة للأكسدة في تطهير الجسم من السموم، كما أنها تدعم عمل الغدة الدرقية، وتساعد على التحكم في زيادة الوزن.`
    },
    {
        title: 'المكسرات',
        desc: `من أعراض فرط نشاط الغدة الدرقية، زيادة الشهية، لذا فإن تناول المكسرات، خاصة الجوز يمكن أن يحل هذه المشكلة، فهو يعطي إحساسا بالشبع يدوم لفترة. 
كما أنها مصدر رئيسي من مصادر مادة السيلنيوم المضادة للأكسدة والتي تفيد بشكل كبير مرضى فرط نشاط الغدة الدرقية.`
    }
];
const marad = [
    {
        title: 'الأطعمة الغنية بالدهون غير المشبعة',
        desc: `يتعين على مرضى فرط نشاط الغدة الدرقية الابتعاد عن الأطعمة الدهنية الغنية بالدهون غير المشبعة والأحماض الدهنية المشبعة، لأنها تقلل من قدرة الجسم على امتصاص الهرمونات الدرقية، كما أنها تؤثر على مستويات إنتاج الغدة الدرقية للهرمونات.`
    },
    {
        title: 'الكافيين',
        desc: `يؤثر الكافيين على امتصاص الأدوية في الأمعاء، ما يعوق تنظيم إفرازات الغدة الدرقية.`
    },
    {
        title: 'الخضراوات الكرنبية أو الخردلية',
        desc: `ؤثر الخضراوات الكرنبية مثل القرنبيط، البروكلي، اللفت والملفوف، سلباً على سير عمل الغدة الدرقية. 
كما أنها يمكن أن تؤثر على قدرة الغدة على امتصاص اليود، وهو أمر مهم جداً لضمان عمل الغدة الدرقية بشكل طبيعي.`
    },
    {
        title: 'الصويا',
        desc: `تحتوي أطعمة الصويا على مادة فيتويستروغنز التي تعرقل عمل أنزيم الغدة الدرقية، والذي يشكل هرمونها، هذا بالإضافة إلى أن تناول الصويا يزيد من فرص الإصابة بفرط نشاط الغدة الدرقية.`
    },
    {
        title: 'الأطعمة المصنعة',
        desc: `الكميات الكبيرة من الصوديوم والموجودة في الأطعمة المصنعة تضر مرضى فرط نشاط الغدة الدرقية بشكل كبير وتجعلهم أكثر عرضة لخطر الإصابة.`  

    }
];
const Anemia = [
    {
        title: 'السبانخ',
        desc: `السبانخ من الخضروات الورقية الداكنة، وهي مصدر جيد للحديد والبوتاسيوم والفيتامينات K و B.
والسبانخ ليست جيدة فقط لنقص الحديد ولكنها تحتوي أيضًا على فيتامين C ، الذي يعزز امتصاص الحديد في الجسم، كما أنها غنية بمضادات الأكسدة التي تسمى الكاروتينات التي تحسن صحتك عن طريق تقليل الالتهاب وزيادة مستويات المناعة، كما أنها مصدر غني جدًا بالحديد ويمكن استهلاكه بأشكال مختلفة.`
    },
    {
        title: 'اللحوم',
        desc: `اللحوم مغذية للغاية، وخاصة لحوم الكبد والكلى والدماغ والقلب، لأنها غنية بفيتامينات ب والنحاس والسيلينيوم. ووجود الحديد والألياف المنخفضة خاصة في اللحوم الحمراء يمكن أن يعالج فقر الدم ويزيد مستويات الهيموجلوبين.`
    },
    {
        title: 'البقوليات',
        desc: `أكثر أنواع البقوليات شيوعًا هي الفول والعدس والحمص وفول الصويا والبازلاء. والبقوليات هي أيضًا مصدر كبير لحمض الفوليك والمغنيسيوم والبوتاسيوم.. إنها تساعد في تلبية احتياجات الجسم من الحديد، خاصة للأشخاص الذين لا يرغبون في تناول اللحوم.`
    },
    {
        title: 'المكسرات والفواكه المجففة',
        desc: `المكسرات مثل التمر والزبيب والجوز واللوز والمشمش المجفف مليئة بالحديد والكالسيوم والمغنيسيوم، ويمكن أن تساعدك هذه المكسرات في بناء نظام مناعة قوي إلى جانب علاج فقر الدم وانخفاض مستويات الهيموجلوبين.`
    },
    {
        title: 'البروكلي',
        desc: `لتحسين امتصاص الحديد من أجل علاج فقر الدم والهيموجلوبين، فإن البروكلي هو الخيار الصحيح، حيث أن له قيمة غذائية عالية إنه ليس مفيدًا فقط لنقص الحديد ، ولكنه أيضًا نبات صليبي يحتوي على الإندول والسلفورافان والجلوكوزينولات هذه مركبات نباتية يعتقد أنها تحمي من السرطان.`
    },
    {
        title: 'السمك',
        desc: `حاول تضمين الأطعمة غير النباتية في نظامك الغذائي أيضًا الأسماك ، وخاصة التونة ، غنية بالحديد وأحماض أوميجا 3 الدهنية التي تعزز صحة الدماغ والقلب وتدعم وظيفة المناعة.`
    },
    {
        title: 'البذور',
        desc: `تعتبر البذور مثل اليقطين والسمسم والكتان من أفضل مصادر الحديد، كما أنها تحتوي على كميات جيدة من البروتين النباتي والألياف والكالسيوم والمغنيسيوم والزنك والسيلينيوم ومضادات الأكسدة ومركبات نباتية مفيدة أخرى أيضًا.
بالإضافة إلى ذلك ، تعد البذور أيضًا مصدرًا رائعًا لأحماض أوميجا 3 وأوميجا 6 الدهنية ، مما يجعلها غذاءً مثاليًا لمحاربة فقر الدم وانخفاض مستويات الهيموجلوبين.`
    
}
];
const bloodPressure = [
    {
        title: 'الإكثار من تناول الملح',
        desc: `الأنظمة الغذائية منخفضة الصوديوم ليست فكرة جيدة لمن يعانون من ضغط الدم المنخفض، إذ يُنصح الأفراد الذين يعانون من انخفاض ضغط الدم زيادة الملح في وجباتهم اليومية بشكل معتدل للمساعدة في رفع ضغط الدم.`
    },
    {
        title: 'تناول وجبات صغيرة خلال اليوم',
        desc: `قد يساعد الحصول على وجبات صغيرة ومتكررة على مدار اليوم في علاج انخفاض ضغط الدم بالغذاء، لذلك اختر الوجبات الصحية والمفيدة لصحتك`
    },
    {
        title: 'الأطعمة الغنية بفيتامين ب12',
        desc: `تساعد الأطعمة الغنية بفيتامين ب12، مثل: البيض، واللحوم، ومنتجات الألبان، وحبوب الإفطار المدعمة، وبعض منتجات الخميرة الغذائية في رفع ضغط الدم المنخفض`
    },
    {
        title: 'الأطعمة الغنية بحمض الفوليك',
        desc: `إن الأطعمة المحتوية على نسبة عالية من حمض الفوليك، مثل: الخضار الورقية الخضراء، والفواكه، والمكسرات، والفاصوليا، والبيض، ومنتجات الألبان، واللحوم، والدواجن، والمأكولات البحرية، والحبوب جيدة لرفع ضغط الدم.`
    },
    {
        title: 'الأطعمة والمشروبات التي تحتوي على مادة الكافيين',
        desc: `تسبب الأطعمة والمشروبات التي تحتوي على الكافيين ارتفاعًا في ضغط الدم، إذ وجد أن القهوة ترفع ضغط الدم مؤقتًا فقط لدى الأشخاص الذين لا يشربونها بانتظام، وتشمل الأطعمة والمشروبات الأخرى التي تحتوي على الكافيين: الشوكولاته، والشاي، والكاكاو، وبعض المشروبات الغازية، ومشروبات الطاقة.﻿ `

    }
];
const eyeHealth = [
    {
        title: 'السمك',
        desc: `نظرا لأن الأسماك غنية بأحماض أوميغا 3 الدهنية، فيمكن أن تساعد في الحفاظ على صحة شبكية العين وتحسين البصر.`
    },
    {
        title: 'البيض',
        desc: `صفار البيض مليء بالفيتامينات للحفاظ على البصر في حالة جيدة. ويحتوي صفار البيض النموذجي على العناصر الغذائية التالية المفيدة للعين:

- فيتامين A
- اللوتين
- الزياكسانثين
- الزنك
ويحمي فيتامين A القرنية بينما يمكن أن يقلل اللوتين والزياكسانثين من خطر الإصابة بالتنكس البقعي أو الغلوكوما.
ومن المعروف أن الزنك هو مفتاح الرؤية بشكل أفضل في الليل، أو عندما تكون الأضواء منخفضة.`
    },
    {
        title: 'الجزر',
        desc: `يشتهر الجزر بتحسين البصر، وهو طعام رائع لتناوله إذا كنت ترغب في تعزيز رؤيتك.
ويحتوي الجزر على مستويات عالية من فيتامين A وبيتا كاروتين، وكلاهما سيساعد في الحفاظ على صحة العينين.
وأحد أعراض نقص فيتامين A هو العمى الليلي، لذا فإن تناول الجزر يمكن أن يساعدك على تجنب ذلك، لكنه لن يمنحك رؤية ليلية خارقة للطبيعة`
    },
    {
        title: 'اللوز',
        desc: `اللوز مليء بفيتامين E. وغالبا ما يُنسب هذا الفيتامين إلى جعل بشرتك ناعمة وسلسة بشكل جميل، ولكنه قد يحسن أيضا البصر ويقلل من خطر الإصابة بإعتام عدسة العين`
    },
    {
        title: 'الكالي (البروكلي الصحية)',
        desc: `غالبا ما يتم اعتباره طعاما فائقا، وهو يتمتع بالتأكيد ببعض المؤهلات الصحية الرائعة.

ويحتوي الكالي على نسبة عالية من مضادات الأكسدة بما في ذلك اللوتين والزياكسانثين والتي يمكن أن تساعد في تقليل خطر الإصابة بأمراض العين الخطيرة مثل إعتام عدسة العين والضمور البقعي.`
    },
    {
        title: 'البرتقال',
        desc: `البرتقال غني بفيتامين C الذي يملك العديد من الوظائف الهامة في الجسم.
وتتمثل إحدى وظائف فيتامين C في الحفاظ على صحة الأوعية الدموية في العين وهو أمر ضروري لصحة العينين.`

}
];
const digestiveSys= [
    {
        title: 'الحبوب الكاملة',
        desc: `غنية بالألياف ومفيدة جدًا للجهاز الهضمي، يعالجون أعراض الجهاز الهضمي مثل حرقة المعدة والغازات والغثيان تحافظ الحبوب الكاملة على حركة أمعائك بسلاسة.`
    },
    {
        title: 'الزبادي',
        desc: `يحتوي الزبادي على البكتيريا المفيدة لعملية الهضم، يجب تضمينه في نظامك الغذائي اليومي لتجنب أي مشاكل في الجهاز الهضمي.`
    },
    {
        title: 'الزنجبيل',
        desc: `تناول الزنجبيل النيء يمكن أن يعالج الإمساك،  الزنجبيل غني بالألياف المفيدة للغاية لعملية الهضم.`
    },
    {
        title: 'الموز',
        desc: `يشتهر الموز بعلاج مشاكل وأمراض المعدة مثل الإسهال، إنها مسئولة عن الأداء السلس لأمعائك إذا كنت تأكل موزة واحدة كل يوم ، فسيستمر جهازك الهضمي في العمل بشكل جيد.`
    },
    {
        title: 'البابايا',
        desc: `البابايا لها خصائص مضادة للالتهابات تعمل على تهدئة اضطراب المعدة يساعد في هضم الطعام بسهولة يسهل عملية الهضم ويعالج أعراض مثل حرقة المعدة والغازات`
    },
    {
        title: 'الخيار',
        desc: `يعد الخيار مصدرًا غنيًا بالألياف المفيدة للجهاز الهضمي يبرد معدتك ويوفر الراحة من أي أعراض أخرى في الجهاز الهضمي.`
    },
    {
        title: 'الطماطم',
        desc: `الطماطم صحية جدًا لمعدتك تحتوي على مادة الليكوبين التي تساعد في عملية الهضم. الطماطم غنية بالمغنيسيوم والألياف.`
    },
    {
        title: 'الكيوي',
        desc: `الكيوي مليء بالعناصر الغذائية المفيدة للغاية لصحة الجهاز الهضمي يحتوي على فيتامين سي والمغنيسيوم والبوتاسيوم والبيبسين وهو أمر جيد جدًا لصحة أمعائك.`
    },
    {
        title: 'التفاح',
        desc: `يضمن التفاح حسن سير الأمعاء تحتوي على بكتيريا مفيدة لصحة أمعائك، يساعد التفاح في عملية الهضم ويحافظ على صحة معدتك.`
    },
    {
        title: 'الجزر',
        desc: `الجزر مفيد جدًا لعملية الهضم. تحتوي على الألياف ومضادات الأكسدة المفيدة لصحة الجهاز الهضمي.`



    }
]
const thinness = [
    {
        title: 'الجوز (عين الجمل)',
        desc: `فهو غني بالدهون المفيدة والألياف والبروتينات. فيمكن إضافة حوالي 30 غراماً من الجوز (العين الجمل) لوجباتك اليومية للمساعدة في اكتساب الوزن، إضافة إلى أن الجوز يساعد في تحسين وظائف المخ ويقلل من مستوى الكوليستيرول السيء في الجسم.`
    },
    {
        title: 'الأجبان',
        desc: `فهي مصدر رئيسي للكالسيوم وفيتامين "B12"، وشريحة الجبن تحتوي على حوالي 100 سعرة حرارية، لذا فلمن يعاني من النحافة الشديدة، عليه بإدخال الأجبان بأنواعها المختلفة ضمن نظامه الغذائي اليومي.`
    },
    {
        title: 'المعكرونة',
        desc: `فهي من الأطعمة التي تحتوي على النشويات ويمكن أن تساعد في اكتساب بعض الوزن لاحتوائها على الكثير من السعرات الحرارية.`
    },
    {
        title: 'زبدة الفول السوداني',
        desc: `فهي غنية بالبروتينات والبوتاسيوم والدهون المفيدة للجسم، التي قد تساعد شديدي النحافة في اكتساب الوزن.`
    },
    {
        title: ' البيض',
        desc: `فطبق من البيض المخفوق يحتوي على الدهون المفيدة والسعرات العالية التي تساعد في اكتساب بعض الوزن.`
    },
    {
        title: 'الشوكولاتة الداكنة',
        desc: `فقد أثبتت الدراسات أن قطعة الشوكولاتة الداكنة يمكنها أن تساعدك في اكتساب الوزن بطريقة صحية وبدون إحداث أي أضرار صحية للجسم.`
    },
    {
        title: 'الزبادي',
        desc: `فهو من الأطعمة الغنية بالعناصر الغذائية المفيدة جداً والتي قد تساعد في اكتساب جسمك لبعض الوزن بطريقة صحية (بعيداً عن الأنواع خالية الدسم).`






    }
];

const obesity = [
    {
        title: ' الأفوكادو',
        desc: `نظرًا لاحتواء الأفوكادو على نسبة عالية من الدهون الصحية غير المُشبعة، فإنّ ذلك يُساعد على الشعور بالشبع لفترة طويلة.`
    },
    {
        title: 'السمك والمأكولات البحرية',
        desc: `تُعدّ المأكولات البحرية مصدرًا ممتازًا للعديد من العناصر الغذائية، مثل: البروتين، والدهون الصحية، والألياف، والفيتامينات والمعادن لا سيّما فيتامين د`
    },
    {
        title: 'الخضار الصليبية',
        desc: `الخضار الصليبية، مثل: البروكلي، والملفوف الأبيض والأحمر، والقرنبيط، والكرنب المُجعَّد، تحتوي على نسبة عالية من الألياف التي تُساعد على الشعور بالشبع لوقت أطول بالإضافة إلى الوقاية من الإمساك.`
    },
    {
        title: 'البطاطا',
        desc: `إنّ تناول البطاطا مسلوقة أو مشويّة ضمن نظام غذائي صحّي قد تُساعد على الشعور بالشبع وإنقاص الوزن، لكنّ البطاطا المقليّة غير محسوبة.`
    },
    {
        title: 'أصناف أخرى',
        desc: `إليكم بعض الأصناف الغذائية الأخرى التي تُساعد على الشعور بالشبع لفترات أطول بالإضافة إلى تزويد الجسم بالعناصر الغذائية المطلوبة:

البقوليّات والفاصولياء، مثل: الحمص، والفول، والعدس، والبازلاء الخضراء.
التوتيّات بأنواعها، مثل: الفراولة، والتوت البرّي، والتوت الأزرق.
البيض.
المكسرات.
الحبوب الكاملة، مثل: البرغل، والفريكة.`
}
];



































const tiringResist  = [
    {
        title: ' الموز',
        desc: `الموز يحتوي على البوتاسيوم وفيتامين "بي" و"سي" وأحماض "أوميغا 3" الدهنية والألياف والكربوهيدرات، مما يساعدنا على مقاومة الجفاف وتخفيف أعراض التعب.`
    },
    {
        title: 'الشاي الأخضر',
        desc: `أما العلاج الطبيعي الأمثل للإجهاد والتعب المرتبطين بالعمل، فهو الشاي الأخضر لأنه يحتوي على مادة البوليفينول التي تساعد على تقليل التوتر وزيادة مستويات الطاقة وتحسين التركيز.`
    },
    {
        title: 'الماء',
        desc: `يتكون ثلثا جسم الإنسان من الماء، لذلك فإن الجفاف هو أحد الأسباب الرئيسية لنقص الطاقة والشعور بالإرهاق. وإذا لم يحصل الجسم على كمية كافية من الماء، فلن يكون لديه الطاقة الكافية للقيام بالمهام اليومية.`
    },
    {
        title: 'بذور اليقطين',
        desc: `بذور اليقطين مفيدة جدا لمقاومة الإرهاق، فهي غنية بالبروتينات وأحماض أوميغا 3 الدهنية وفيتامينات "بي1″ و"بي2″ و"بي5" و"بي6″، بالإضافة إلى احتوائها على المغنيسيوم والمنغنيز والحديد والفسفور. وتساعد هذه المغذيات على تحسين وحماية جهاز المناعة وتزوّدنا بالطاقة.`
    },
    {
        title: 'الزبادي',
        desc: `يعتبر الزبادي أحد الأطعمة الغنية بالبروتينات والكربوهيدرات، وهي مفيدة جدا في تقليل أعراض التعب. كما يساعد البروبيوتيك الموجود في الزبادي على التخفيف من أعراض التعب المزمن، وتحسين صحة الجهاز الهضمي.`
    },
    {
        title: 'البطيخ',
        desc: `يساعد البطيخ على توفير السوائل التي يحتاجها الجسم خاصة في فصل الصيف.
البطيخ غني بالماء والإلكتروليتات التي تساعد على تجنب الجفاف وتعزيز النشاط، كما يحتوي على عناصر غذائية مثل البوتاسيوم وفيتامين "سي" وبيتا كاروتين التي تساعد على مكافحة أعراض التعب.`
    },
    {
        title: 'الفلفل الأحمر',
        desc: `يعتبر الفلفل الأحمر مصدرا ممتازا لفيتامين "سي"، وبفضل خصائصه المضادة للأكسدة، فإنه يساعد على تعزيز المناعة.`
    },
    {
        title: 'البقوليات',
        desc: `توفر البقوليات العديد من الفوائد الصحية وتساعد على مكافحة الإرهاق بفضل ما تحتويه من ألياف وكربوهيدرات وبروتينات ومعادن، مثل البوتاسيوم والفوسفور والحديد والمغنيسيوم. وتعدّ البقوليات غذاء مثاليا لتزويد الجسم بالطاقة.`
    },
    {
        title: ' الجوز',
        desc: `الجوز هو أحد الأطعمة التي تساعد على محاربة التعب بفضل ما يحتويه من أحماض أوميغا 3 الدهنية، كما يمدنا الجوز بالطاقة ويساعد على التعافي واستعادة النشاط بعد التمارين الرياضية.`
    },
    {
        title: 'السبانخ',
        desc: `تعرف السبانخ بأنها غنية جدا بالحديد، وهو معدن يساعد الدم على نقل الأكسجين إلى خلايا الجسم، وبالتالي زيادة مستويات الطاقة ومكافحة التعب.`
    }
]




const heartDes = [
    {
        title: 'البروكلي',
        desc: `يعمل البروكلي على إزالة السموم الطبيعية من مجرى الدم في الجسم. ولأنه يحتوي على الألياف الصحية، فإن البروكلي يساعد جسمك على خفض ضغط الدم، وبالتالي يقلل من خطر تمزق الشرايين.`
    },
    {
        title: 'الجوز',
        desc: `الجوز غني بالمغنيسيوم. وأثبتت الدراسات أن المغنيسيوم يقلل من تراكم الترسبات في الشرايين. كما أن الجوز مليء بالأحماض الدهنية "أوميغا 3"، وهو عامل آخر في مكافحة تراكم الكوليسترول السيئ.`
    },
    {
        title: 'الحبوب الكاملة',
        desc: `توصي جمعية القلب الأميركية بخمس أو ست حصص من الحبوب الكاملة يوميا، فهي تقلل من الكولسترول السيئ وتحسن الكولسترول الجيد. ويعد الأرز البني أبر هذه الحبوب.`
    },
    {
        title: 'السبانخ',
        desc: `السبانخ غني بمادة البوتاسيوم، كما أنه يحتوي على الألياف. ويقول خبراء التغذية أن كمية قليلة من السبانخ بين الفترة والأخرى من شأنها أن تمنع انسداد الشرايين وأن تخفض ضغط الدم.`
    },
    {
        title: 'زيت الزيتون',
        desc: `يعد زيت الزيتون علاجا فعالا للمشكلات الناجمة عن الكولسترول السيئ، فهو غني بمضادات الأكسدة وأحماض الأولييك غير المشبعة، ويوفر نظاما صحيا للدورة الدموية`
    },
    {
        title: 'الكركم',
        desc: `يتألف الكركم بشكل رئيسي من الكركمين، ويتميز بكفاءته العالية في إصلاح تلف جدران الشريان، بسبب قدرته الفائقة على مقاومة الالتهابات. وأثبتت الدراسات نجاعة الكركم في منع الترسبات في الدم.`
    },
    {
        title: 'الأفوكادو',
        desc: `يمكن استخدام الأفوكادو عصيرا أو في العديد من الأطباق الأخرى، مثل السلطة. فهو يحسن الصحة العامة ويعمل على تقليل الكولسترول السيئ وكذلك يخفض ضغط الدم بسبب غناه بفيتامين E.`
    },
    {
        title: 'السمك',
        desc: `تناول السمك مرتين في الأسبوع يساعد على تقليل تراكم الترسبات في الشرايين، فالأحماض الدهنية الموجودة في سمك السلمون والتونة والسردين والماكريل، تساعد على تقليل مستويات الدهون الثلاثية، كما تعالج التهاب الأوعية الدموية.`
    },
    {
        title: 'البطيخ',
        desc: `يعتبر البطيخ الخيار الأفضل لرفد الجسم بأكسيد النيتريك، الذي ثبت علميا أنه يخفض ضغط الدم ويقلل الالتهابات ويحسن عمل الشرايين. وللبطيخ دور مهم في خفض الدهون في البطن.`
    },
    {
        title: 'الثوم',
        desc: `الثوم معروف بدوره الفعال في إذابة أي ترسبات في الأوعية الدموية، فهو يحارب إنزيما يعرف باسم الأنجيوتنسين الذي يضيق الأوعية الدموية.`


    }
]



const neg= [
    {
        title: 'الحبوب المكررة',
        desc: `لا تحتوي الحبوب المكررة، مثل: الأرز، والخبز، والمعكرونة والوجبات الخفيفة المصنوعة من الدقيق الأبيض على الألياف والفيتامينات والمعادن الصحية، إنما تتحول بسرعة إلى سكر يخزنه الجسم على شكل دهون
يجب استبدال هذه الأطعمة بالحبوب الكاملة، مثل:

الأرز البني.
الشوفان.
القمح الكامل.`
    },
    {
        title: 'الدهون غير الصحية',
        desc: `إذ يعد الحد من كمية الدهون المشبعة والمتحولة التي يتناولها مريض القلب يوميًا خطوة مهمة لـِ:

تقليل نسبة الكوليسترول في الدم.
تقليل خطر الإصابة بمرض الشريان التاجي إذ من الممكن أن يؤدي ارتفاع مستوى الكوليسترول في الدم إلى تصلب الشرايين.`
    },
    {
        title: 'الحد من السكر والملح والكربوهيدرات المكررة',
        desc: `يزيد تناول الكميات الكبيرة من الملح، والسكر، والكربوهيدرات المكررة من خطر الإصابة بنوبة قلبية أو سكتة دماغية.`
    },
    {
        title: 'اللحوم الحمراء والمصنعة',
        desc: `فبالرغم من أن اللحوم من الأطعمة الغنية بالبروتينات، والحديد، والزنك، وفيتامينات المجموعة ب الضرورية لصحة البدنية، لكنها تحتوي على كميات كبيرة من الكوليسترول، والأحماض الدهنية المشبعة التي تزيد بدورها من خطر زيادة أعراض مرض القلب. `
    },
    {
        title: 'البيتزا والمعجنات',
        desc: `يمكن أن تكون البيتزا صحية إذا حُضرت بالطريقة الصحيحة، لكن غالبًا ما تحتوي البيتزا المتناولة خارج المنزل والمعجنات على كميات كبيرة من الآتي:
الصوديوم.
الدهون.
السعرات الحرارية.
هذه العناصر الغذائية جميعها تزيد خطر الإصابة بنوبات قلبية.`
    },
    {
        title: 'الزبدة',
        desc: `إذ تُعد الزبدة من الأطعمة الغنية بالدهون المشبعة التي يمكن أن ترفع نسبة الكوليسترول الضار، وتزيد من احتمالية الإصابة بأمراض القلب. 
لذا من الأفضل استبدال الزبدة بزيت الزيتون أو الزيت النباتي الذي يحتوي على دهون أحادية غير مشبعة.`
    
}
]


const insideBody = [
    {
        title: 'أطعمة تغذي البشرة من الداخل',
        desc: `معجون الطماطم والبطيخ وثمر الورد أو الكركديه هي أغذية غنية بالليكوبين المضاد للأكسدة والذي يحارب الجذور الحرة في الجلد التي يسبهها التعرض لأشعة الشمس والتدخين. وتضم القامة أيضا أسماك البحر الدهنية مثل السلمون والماكريل والرنجة، التي توفد بروتيناً عالي الجودة للبشرة الجافة بالإضافة إلى أحماض أوميغا -3 الدهنية وفيتامين د والسيلينيوم التي تمنع الالتهاب.
        المكسرات و الأفوكادو والزيوت النباتية مثل زيت بذور الكتان والجوز وزيت اللفت وزيت الزيتون الأحماض الدهنية الأحادية غير المشبعة و التي تعزز بنية وتجديد الجلد. كما أنها تضمن نسبة كافية من أحماض أوميغا 3 إلى أوميغا 6 الدهنية الكافحة للالتهابات
        إذا تم معالجة أوجه القصور في النظام الغذائي يتوقف تساقط الشعر. من حيث التغذية والشعر الصحي     
        تأكد أن نظامك الغذائي يحتوي على الماغنيسيوم والبيوتين والزنك والحديد والفيتامينات، الأمر الذي يمكن أن يساعد في الحفاظ على قوة الشعر وحجمه الأمثل.        

        `
    },
    
    {
        title: 'الأحماض الدهنية الأساسية',
        desc: `فالأحماض الدهنية أوميغا 3 تغذي وتحمي الشعر، وتساعد في نموه، وتضيف لمعانًا ناعمًا، كما تحتوي الأسماك الدهنية مثل السلمون على الكثير من أوميغا 3 ، كما أن الجوز وبذور الشيا وبذور الكتان وفول الصويا مصادر جيدة لمغذيات الشعر.

        أيضا تساعد الفيتامينات على تكوين خلايا الدم الحمراء، التي تحمل الأكسجين والمواد الغذائية إلى فروة الرأس وبصيلات الشعر. كما يمكنك العثور على فيتامين بي 6 في الموز والبطاطس، و بي 12 في اللحوم ومنتجات الألبان، وحمض الفوليك في الحمضيات والطماطم.

        يحافظ فيتامين د على صحة الجلد والعظام والشعر. 
        يمكنك العثور على فيتامين د في الأسماك الدهنية والكبد وصفار البيض والأطعمة المدعمة مثل الحليب.
        `
    },
   
]





