const foods = [
  {
    title: "الاكل المسلوق",
    img: "1",
    text: `ولإن اغلبنا بيحب الفراخ ده طرق صحيه اكتر ممكن تاكلها بيها :`,
    ways: [
      {
        title: ``,
        desc: `الأكل المتوازن هو الافضل صحيًا لانه بيحافظ على القيمة الغذائية للأكل، وده عكس اللى بيعمله القلىّ لانه بيدمر العناصر الغذائية فى أى أكل، أما الأكل المسلوق فهو بيكسر المركبات المعقدة لمركبات بسيطة سهلة الهضم، فالأطعمة المسلوقة مبتسببش السمنه وكمان بتساعد على انقاص الوزن وتحسين نسيج الجلد ونمو الشعر والوقاية من الحموضة وحصى الكلى والتهاب المعدة.
- وده أحسن الأطعمه المسلوقة :
١- البطاطس 
٢- البيض
٣- الفاصوليا الخضرا
٤- البقوليات
٥- الدرة
٦- البروكلي`,
        img: "",
      },
      {
        title: "الخضار المشوي",
        desc: `بس فيه حل تانى لو مش بتحب الأكل المسلوق 😉
وهو الخضار المشوى ..
اعمل خضار مشوى فى الفرن ازاى 👈
½ كيلو بطاطس مقشرة ومقطعة مكعبات متوسطة الحجم. 
¼ كيلو (250 جرام) كوسة مقطعة حلقات متوسطة الحجم.
¼ كيلو  جزر مقطع حلقات متوسطة الحجم.
¼ كوب بقدونس مفروم.
بصلة صغيرة مقطعة مكعبات صغيرة.
2 ملعقة كبيرة كزبرة طازجة مفرومة.
2 ملعقة كبيرة زيت زيتون.
2 ملعقة كبيرة عصير ليمون.
2 ملعقة كبيرة خل.
ملعقة صغيرة بهارات إيطالية (زعتر مجفف، وريحان مجفف)`,
        img: "2",
      },
      {
        title: "بدائل الزيوت",
        desc: `ده بقى بدايل لزيت الطعام لان زى ما انت عارف انت زيت القلىّ ليه اضرار كتير.
بدائل الزيوت :
١ - زيت السمسم:
تعتبر بذور السمسم من أصناف البذور المشهورة المستخدمة كمقبلات ،كما أنها مصدر لزيت السمسم الذي يمكن استخدامه كزيت طبخ صحي، زيت السمسم مصدر لأحماض أوميغا 3 الدهنية والدهون الصحية.
٢- زيت بذور الكتان: 
يمكن استخدام زيت بذور الكتان كبديل للزيت نظرًا لفوائده الصحية، بصرف النظر عن كونه مصدرًا للدهون الصحية، فإن هذا النوع من الزيوت يعزز صحة الجلد والشعر، وله خصائص مضادة للالتهابات، ويحسن صحة الجهاز الهضمي.
٣-السمن: 
السمن الطبيعى من المصادر الحيوانية له خصائص مضادة للالتهابات، وهو مصدر للدهون الصحية، ويمكن أن يساعد في تحسين صحة الجهاز الهضمي، يمكن استخدامه أيضًا كبديل زيت صحي.
٤- زيت جوز الهند:
من الماء إلى الحليب، جوز الهند هو فاكهة متعددة الاستخدامات ومغذية …`,
        img: "3",
      },
      {
        title: "بدائل السكر",
        desc: `وده بقى يا سيدى بدايل السكر لان زى ما انت عارف ان الزيادة ف تناول السكر ممكن يؤدى لزيادة مستويات الدهون الثلاثية وده ممكن يزود من خطر الاصابه بأمراض القلب ده غير تسوس الاسنان والسمنه ومرض السكرى وامراض الكبد والفشل الكلوى وآلام المفاصل؛ علشان كده ده بدايل السكر :
١- سكر ستيفيا :
وده أحد أنواع السكر الطبيعي المأخوذ من أوراق شجرة “ستيفيا”، الموجودة في جنوب أمريكا.
وهو موجود بشكل سائل أو مجفف، ده غير انه مفيهوش أي سعرات حرارية، وطعمه اكتر حلاوة بحوالي 450 مرة من السكر العادى، مع بعض الاختلافات طبعًا في المذاقين.
وده بيقلل من فرصة الاصابة بالسمنه ومرض السكرى.
٢- الفواكة وعصائر الفاكهه الطبيعية :
ده غير انه سكر طبيعى مش مكرر وانه مليان أحماض وفيتامينات لا ده كمان بيقلل من فرص الاصابه بالسمنه والجسم محتاجه وبيقلل من سكر الدم عند الاشخاص المصابين بمرض السكرى وغير…`,
        img: "4",
      },
      {
        title: "وصفات اللحوم",
        desc: `وده بقى شوية افكار ممكن تطبخ بيهم اللحمه علشان تحبب نفسك فيها :`,
        img: "5",
      },
      {
        title: "طاجن اللحم",
        desc: `
المقادير:
- لحم البتلو : 250 غراماً (بدون دهون)
- البصل : 2 حبة (مقطعة شرائح)
- بندورة : 4 حبات (مقطعة شرائح)
- الفلفل الأخضر : 1 حبة (مقطعة شرائح)
- الفلفل الأحمر : 1 حبة (مقطعة شرائح)
- الجزر : 2 حبة (مقطعة دوائر)
- الفطر : علبة (طازج أو معلب مقطع)
- الكرات : عود (مفروم)
- الكرفس : 2 عود (مفروم)
- ملح : ملعقة صغيرة
- زيت الزيتون : ربع كوب
- فلفل أسود : نصف ملعقة صغيرة
- مرق دجاج : 1 مكعب
- معجون الطماطم : 3 ملاعق كبيرة
- زعتر مجفف : ملعقة كبيرة
`,
        img: "",
      },
      {
        title: ``,
        desc: `ستيك بصوص الفلفل الشهي:
المقادير:
-الستيك : 500 غراماً (شرائح)
- فلفل أسود : ملعقة كبيرة (حبّ)
- كريما سائلة : كوب (خالية الدسم)
- طحين : ملعقة كبيرة
- ملح : نصف ملعقة صغيرة
- الماء : كوبان
- الزيت النباتي : ملعقتان كبيرتان
- فلفل أسود : ملعقة صغيرة (مطحون)
- الزبدة : ملعقة كبيرة`,
        img: "",
      },
      {
        title: ``,
        desc: ` شوربة كرات اللحم الإيطالية:
المقادير:
-لحم بقري
-2 بيضة متوسطة أو بيضة واحدة كبيرة جدًا
-1⁄4 كوب بقسماط
-1⁄2 كوب جبن بارميزان مبشور ناعم
-ملح وفلفل أسود مطحون حسب الرغبة
-1⁄2 ملعقة كبيرة زيت زيتون
-1 بصلة مفرومة
-2 حبات جزر مقشرة ومفرومة
-2 ضلع كرفس مفروم
-8 أكواب مرق دجاج قليل الصوديوم
-1 رأس إسكارول ، مقطع إلى قطع صغيرة الحجم
-3⁄4 كوب معكرونة صغيرة ، مثل الأورزو ، أو الباستينا ، أو السباغيتي مقسمة إلى قطع بحجم 1⁄2 بوصة`,
        img: "",
      },
      {
        title: "كبسه لحم",
        desc: `:
المقادير:
-لحم ضان مقطع قليل الدهون
-٣أكواب أرز بسمتي
-ملح حسب الرغبة
-كوب بصل مفروم
-٢معلقة كبيرة ثوم مفروم
-نصف معلقة زعفران منقوع بالقليل من ماء الزهر
-٣معالق كبيرة زيت نباتي
-معلقة كبيرة بهارات`,
        img: "",
      },
      {
        title: `طاجن اللحم المميز والشهي`,
        desc: `المقادير:
لحم البتلو : 250 غراماً (بدون دهون)
- البصل : 2 حبة (مقطعة شرائح)
- بندورة : 4 حبات (مقطعة شرائح)
- الفلفل الأخضر : 1 حبة (مقطعة شرائح)
- الفلفل الأحمر : 1 حبة (مقطعة شرائح)
- الجزر : 2 حبة (مقطعة دوائر)
- الفطر : علبة (طازج أو معلب مقطع)
- الكرات : عود (مفروم)
- الكرفس : 2 عود (مفروم)
- ملح : ملعقة صغيرة
- زيت الزيتون : ربع كوب
- فلفل أسود : نصف ملعقة صغيرة
- مرق دجاج : 1 مكعب
- معجون الطماطم : 3 ملاعق كبيرة
- زعتر مجفف : ملعقة كبيرة`,
        img: ``,
      },
      {
        title: `شطيرة اللحم المشوي والافوكادو`,
        desc: `لمقادير:
350 غراماً من شرائح اللحم البقري.
نصف كوب من الصلصة الإيطالية الجاهزة.
1/2 ملعقة صغيرة من قشر الليمون المبشور.
1/4 كوب من عصير الليمون.
2 ملعقة كبيرة من الكزبرة الطازجة المفرومة.
1/4 كوب من البصل المقطّع بشكل ناعم.
1/4 ملعقة صغيرة من الملح.
1/4 ملعقة صغيرة من الفلفل الأسود المطحون.
4 أكواب من الخضراوات الورقية المفضّلة.
1 حبة متوسطة من الفلفل الأحمر الحلو، المقطع إلى شرائح رفيعة.
1 حبة أفوكادو متوسطة الحجم، ومقطعة إلى شرائح رفيعة.
3 شرائح خبز من القمح الكامل، مقطعة إلى نصفين`,
        img: ``,
      },
      {
        title: `لحمه بالخضار `,
        desc: `اللحم : 500 غراماً (فيليه مقطع مكعبات)
- الكوسا : 2 حبة (مقطعة دوائر)
- البطاطس : 1 حبة (كبيرة الحجم / مفرومة مكعبات)
- الفلفل الأحمر : 1 حبة (مفروم مكعبات كبيرة)
- الفلفل الأخضر : 1 حبة (مفروم مكعبات كبيرة)
- الجزر : 2 حبة (مفروم شرائح)
- البصل : 1 حبة (مفروم شرائح)
- ملح : نصف ملعقة صغيرة
- فلفل أسود : نصف ملعقة صغيرة
- الماء : نصف كوب
- طماطم : 2 حبة (كبيرة الحجم / مقطعة مكعبات)
- معجون الطماطم : ملعقة كبيرة
- زيت الزيتون : 3 ملاعق كبيرة`,
        img: ``,
      },
      {
        title: ` اسياخ اللحمه المشوية بالخضار`,
        desc: ` ملعقة كبيرة عصير ليمون طازج.
1 ملعقة كبيرة ماء.
1 ملعقة كبيرة خردل ديجون( خردل ديجون مصنوع من بذور الخردل الأسود ، مما يجعله بهارات أكثر من الخردل الأصفر. كما أنه يحتوي على خل أقل ، ودسم ، ولونه أصفر باهت من الخردل الأصفر)
1/2 ملعقة صغيرة زعطر طازج ومقطع.
1/2 ملعقة صغيرة فلفل أسود مطحون.
1 شريحة من اللحم ، مقطعة إلى مربعات.
1 حبة فلفل حمراء كبيرة مقطعة إلى مربعات.
1 بصلة متوسطة الحجم، ومقطعة إلى مربعات.
1 حبة كوسا متوسطة الحجم، ومقطعة إلى شرائح سميكة.
20 شريحة من المشروم.`,
        img: ``,
      },
      {
        title: ``,
        desc: ``,
        img: ``,
      },
      {
        title: ``,
        desc: ``,
        img: ``,
      },
      {
        title: ``,
        desc: ``,
        img: ``,
      },
    ],
  },
  // ==========================================
  {
    title: "وصفات فراخ",
    img: "6",
    text: `ولإن اغلبنا بيحب الفراخ ده طرق صحيه اكتر ممكن تاكلها بيها`,
    ways: [
      {
        title: "الدجاج الصحي",
        desc: `دجاجة مقطعة منزوعة الجلد.
ثلاث حبات من الفلفل الحلو المُلون. 
ثلاث حبات من البصل كبيرة الحجم.
كوب واحد من الذرة. 
ملعقتان كبيرتان زيت زيتون.
معلقة كبيرة من البهارات المشكلة. 
فصان من الثوم المهروس. 
ملعقة كبيرة كزبرة مُجففة.
زنجبيل مطحون وملح وفلفل أسود حسب الحاجة.`,
        img: "",
      },
      {
        title: `كفته الدجاج الصحيه`,
        desc: `المقادير:
نصف كيلو صدور دجاج خالية من الجلد
بقسماط مطحون
بيضة
زيت زيتون الصحي
بهارات دجاج صحية
زعتر جاف
ثوم بودرة
بصل بودرة
بقدونس مفروم
ملح`,
        img: ``,
      },
      {
        title: `سلطة كينوا بالافوكادو وصدر الدجاج:`,
        desc: `المقادير :
500 غرام صدر دجاج
1كوب كينوا منقوع ساعتين
3 ملعقة كبيرة زيت سمسم
1حبة كبيرة : افوكادو - طماطم - خيار- بصل
4/1 باقة بقدونس مفروم
3 ملعقة كبيرة زيت زيتون
3 ملعقة كبيرة خل أو دبس الرمان
4/1  ملح وفلفل اسود ملعقة صغيرة…`,
        img: ``,
      },
      {
        title: `فاهيتا الدجاج الصحية:`,
        desc: `لمقادير:
- صدر الدجاج : 4 صدور (منزوع الجلد، مقطّع إلى شرائح)
- البصل : 2 حبة (حجم متوسّط، مقطّعة إلى شرائح)
- الفليفلة الحمراء : 1 حبة (مقطّعة إلى شرائح)
- الفليفلة الصفراء : 1 حبة (مقطّعة إلى شرائح)
- ذرة اصفر معلب : نصف علبة (مغسولة ومصفاة)
- الفطر : كوب (طازج مقطّع)
- زيت الذرة : ملعقة كبيرة
- فلفل ابيض : ملعقة صغيرة
- فلفل أحمر : نصف ملعقة صغيرة
- القرفة : نصف ملعقة صغيرة
- فلفل أسود : ربع ملعقة صغيرة
- كزبرة يابسة : ربع ملعقة صغيرة
- ملح : ملعقة صغيرة
- خبز التورتيلا : حسب الرغبة`,
        img: ``,
      },
      {
        title: `الفراخ المسلوقة في الفرن:`,
        desc: `لمقادير:
دجاجة كاملة مسلوقة مقطعة إلى 8 قطع
. 2 كوب دقيق
. 2 كوب بقسماط
. ¼ كوب حليب
. 2 بيضة كبيرة
. ملعقة كبيرة مستردة
. ملعقة كبيرة بابريكا
. ½ ملعقة كبيرة زعتر جاف مطحون
. ¾ ملعقة صغيرة زنجبيل مطحون
. ½ ملعقة صغيرة ثوم باودر. 
ملح وفلفل أسود`,
        img: ``,
      },
      {
        title: `البانيه الصحي:`,
        desc: `لمقادير:
نصف كيلو شرائح صدور فراخ
ماء بصل
ملعقة كبيرة من بهارات الفراخ
رشة ملح
رشة فلفل أسود
٢ بيضة
عصير ليمون
دقيق بني
٢ ملعقة حليب خالي الدسم
شوفان مطحون`,
        img: ``,
      },

      {
        title: "الدجاج الصحي بالخضراوات:",
        desc: `المقادير:
2صدور دجاج حجم متوسط مقطعة إلى مكعبات.
1 كوب من الفليفلة الحلوة الملونة مفرومة.
1/2 بصلة مقطعة لشرائح.
1 حبة كوسا مفرومة.
1 كوب من البروكلي.
1/2 كوب من البندورة المفرومة.
2 ملاعق كبيرة من زيت الزيتون.
1/2 ملعقة صغيرة من ملح الطعام.
1/2 ملعقة صغيرة من الفلفل الأسود المطحون.
1 ملعقة صغيرة من البهارات الإيطالية أو أي نوع مفضل لديك.
1/4 ملعقة صغيرة من البابريكا (اختياري)`,
        img: "",
      },
      {
        title: `
شاورما دجاج صحية :`,
        desc: `٤ قطع فيليه من صدور الدجاج 
 ١ حبة بصلة متوسطه الحجم ومقطعه شرائح.
١حبة طماطم كبيرة الحجم وخالية من البذور ومقطعة شرائح.
٢ حبة فلفل الوان مقطع لشرائح.
 نصف كوب زبادي 
٣ معلقة كبيرة من  الخل 
٢ معلقة كبيرة من عصير الليمون 
٦ معلقة كبيرة من الزيت 
 معلقة صغيرة من ثوم بودر 
 معلقة كبيرة من بهارات الشاورما 
 معلقة صغيرة بابريكا 
 معلقة صغيرة حبهان مطحون 
معلقة صغيرة ملح 
 معلقة صغيرة فلفل أسود `,
        img: "",
      },
      {
        title: "المكرونه بالدجاج ",
        desc: `مكرونه أي نوع “عادية أو ملونة”.
كمية من صدور الدجاج.
قطع خبز تورتيلا متبلة بالملح وزيت الزيتون ومقلية في القلاية الهوائية أو مجففة بالفرن.
زيتون أخضر وأسود شرائح.
جبن موتزاريلا أصابع، مقطعة الى دوائر صغيرة.
طماطم كرزية مقطعة إلى أنصاف.
ريحان “إذا لم يوجد يمكن استبداله بالبقدونس”.`,
        img: "",
      },
      {
        title: ``,
        desc: ``,
        img: "",
      },
      {
        title: ``,
        desc: ``,
        img: "",
      },
      {
        title: ``,
        desc: ``,
        img: "",
      },
      {
        title: ``,
        desc: ``,
        img: "",
      },
      {
        title: ``,
        desc: ``,
        img: "",
      },
    ],
  },
  // ==========================================
  {
    title: "وصفات السمك",
    img: "7",
    text: `ودي شوية طرق مختلفة نقدر نعمل بيهم السمك:`,
    ways: [
      {
        title: `وصفه السمك بالخضار :`,
        desc: `
المقادير:
٢ سمكه بلطى حجم متوسط 
سمكه فيليه اى نوع 
بطاطس 
حبه بطاطس 
بصله بيضه 
وعشان نتبل السمك
شطه
ليمون شرائح
كمون ناعم 
ملح 
عصير ليمون 
ثوم مهروس `,
        img: "",
      },
      {
        title: "وصفه سمك فيليه:",
        desc: `المقادير:
نصف كيلو سمك فيليه 
معلقتين زيت زيتون 
خمس فصوص ثوم مهروس 
معلقتين كمون 
نص كوب عصير لمون 
معلقه ملح 
ربع معلقه فلفل اسود 
رشه كركم 
فلفل رومى مقطع شرائح`,
        img: "",
      },
      {
        title: "وصفةالسمك بلطى فى الفرن:  ",
        desc: `المقادير : 
3 حبات سمك بلطى 
 ٢كوب كزبرة مفروم 
 ٢كوب بقدونس 
٢قرن فلفل 
٦ فصوص ثوم مهروس  حبة ليمون مقطع لشرائح  ملعقة ملح طعام 
٤/١ ملعقة صغيرة فلفل أسود 
نصف كوب ماء 
 ربع كوب زيت زيتون`,
        img: "",
      },
      {
        title: "وصفة السمك البوري:",
        desc: `المقادير:
سمك بوري حجم كبير 
بصل 
فلفل رومي 
طماطم 
معلقة عصير ليمون
فلفل حار 
٣معالق من الزيت
ملح 
كزبرة
فلفل أسود`,
        img: "",
      },
      {
        title: "وصفة سمك الرنجة الصنية ",
        desc: `المقادير:
كيلو رنجة
٣حبات طماطم
٢حبة فلفل مقطع شرائح 
بصلة متوسطة
ليمونة 
٢معلقة زيت`,
        img: "",
      },
      {
        title: "وصفة سمك بربوني مشوي:",
        desc: `المقادير:
٥سمك بربوني 
معلقة كبيرة توابل سمك
٢فص ثوم مفروم
معلقة صغيرة كمون
معلقة صغيرة كزبرة
بصلة
٥عود شبت
٢فلفل أخضر
٥معالق كبيرة زيت زيتون
طماطم
٢حبة بطاطس
٣معلقة كبيرة عصير ليمون`,
        img: "",
      },
      {
        title: "وصفة سمك التونة في الفرن:",
        desc: `المقادير:
سمكة تونة متوسطة
ربع كوب عصير طماطم
فص ثوم مهروس
معلقة زيت نباتي
ربع معلقة صغيرة كمون أسود
ربع معلقة صغيرة فلفل
ربع معلقة صغيرة ملح`,
        img: "",
      },
      {
        title: "وصفة سمك السلمون البري المشوي:",
        desc: `المقادير:
٢فص ثوم مهروس
٤ملاعق زيت زيتون
معلقة صغيرة ريحان
معلقة صغيرة فلفل اسود
معلقة كبيرة عصير ليمون
معلقة كبيرة بقدونس
٢معلقة كبيرة سالمون`,
        img: "",
      },
      {
        title: `
وصفة سمك بلطي في الفرن:`,
        desc: `المقادير:
٣حبات سمك بلطي
٢كوب كزبرة مفرومة
٢كوب بقدونس
٢قرن فلفل
٦فصوص ثوم مهروس
حبة ليمون مقطع لشرائح
معلقة صغيرة ملح طعام
ربع معلقة صغيرة فلفل أسود
نصف كوب ماء
ربع كوب زيت زيتون`,
        img: "",
      },
    ],
  },
  // =========================================
  {
    title: `الحلويات`,
    img:``,
    halawyat: true,
    text: ``,
    ways: [
        {
            title: `بان كيك صحي بالشوفان والموز`,
            desc: `المقادير:
1/2 كوب رقائق شوفان كامل غير مطحون .
2 حبة موز مقشر ومقطع.
2 حبة بيض.
1/4 ملعقة صغيرة قرفة.
1/4 ملعقة صغيرة فانيليا.
1/2 ملعقة صغيرة بيكنج باودر.`,
            img: `1`
        },
        {
            title: `بسكويت الشوفان الصحي بالزبيب `,
            desc: `لمقادير:
1 كوب شوفان ملفوف .
1 كوب دقيق قمح .
1/2 كوب ستيفيا أو عسل .
1/2 كوب زيت .
1 ملعقة كبيرة من مسحوق الخبز  .
عدد 2 بيضة .
1 كوب زبيب .`,
            img: `2`
        },
        {
            title: `كيكة التمر بالشوفان الصحية`,
            desc: `المقادير :
3 بيضات 
1 كوب سكر
1 كوب زيت نباتي
1/2 كوب دقيق 
1/2  كوب شوفان
1 ملعقة صغيرة من البيكينج بودر 
1 ملعقة صغيرة قرفة
رشة ملح
مقادير الحشو :
2 كوب تمر  .
2 كوب ماء  .
1 ملعقة صغيرة صودا 
للتزيين : 
1/4 كوب فستق جوز أو لوز حسب الرغبة`,
            img: `3`
        },
        {
            title: `بان كيك بالعسل`,
            desc: `المقادير : 
1 كوب من الدقيق.
1 كوب من الحليب السائل.
بيضة واحدة.
1 ملعقة صغيرة من البيكنج باودر.
1 ملعقة صغيرة من الفانيليا.`,
            img: `4`
        },
        {
            title: `كب كيك الفواكهه :`,
            desc: `المقادير :
2 ثمرة من التفاح المبشور . 
2 ثمرة من الموز . 
كوب ونصف من الدقيق . 
2 ملعقة صغيرة من البيكنج باودر . 
عدد 2 بيضة . 
قالب صغير من الزبدة.
قوالب الكب كيك .`,
            img: `5`
        },
        {
            title: `حلوي Quinoa almond : `,
            desc: `المقادير : 
100 ملليلتر من حليب الصويا . 
60 جرام من جوز الهند .
25 جرام من الشوكولاتة الداكنة.
1/2 ملعقة صغيرة  من البيكنج باودر .
100 جرام من اللوز المطحون .
150 جرام من الدقيق . 
عدد 3 بيضات . 
125 جرام من قصب السكر .`,
            img: `6`
        },
        {
            title: `حلوي Banana mousse dessert`,
            desc: `المقادير : 
موزة واحدة  .
50 جرام من اللبن الرائب .
200 ملليلتر من الكريمة الطازجة . 
1 ملعقة من العسل . 
4 أوراق من النعناع `,
            img: `7`
        },
        {
            title: `البسبوسه`,
            desc: `البسبوسة الصحية  :
المقادير :
البسبوسة الصحية :
نص كوب زبادي
4 معالق سميد
معلقة جوز هند
معلقة صغيرة زبدة طبيعي

مكونات الشربات:
نحتاج للشربات كوب ماء ملعقة عسل إذا كان الطفل أكبر من عام معلقة دبس تمر إذا كان الطفل أقل من عام.`,
            img: `8`
        },
        {
            title: ``,
            desc: ``,
            img: ``
        },
    ]
},
  
];




const foodLabel = [];
const foodCollection = foods
  .filter((a) => a.title !== `` || a.text !== ``)
  .map((a, i) => {
    const wasafat = a.ways.filter((a) => a.title !== `` || a.desc !== ``)
      .map((b, bi) => {
        return `
        <div class="row position-relative g-0 justify-content-center mb-1-6 mb-md-2-2 mb-xl-2-8">
       
        <div class="  col-md-12">
            <div class="card border-0 d-flex flex-lg-row flex-column-reverse border-end-radius-10 border-start-sm-radius-10 h-100 box-shadow-style1">
                <div class="card-body col-lg-8 p-1-9 p-lg-2-5">
                ${b.title ? `<div class="schedule-tag">${b.title}</div>` : ""} 
                    <p  style="white-space:pre-line" class=" ">
                    ${b.desc}
                    </p>
                </div>
                ${a?.halawyat? `<div class="col-lg-4 text-lg-end text-center"><img class="rounded-3 shadow halwyat-img" style="height: 250px;" src="../img/sweets/${b.img}.jfif" alt="" /></div>` : ''}
            </div>
        </div>
    </div>
        `;
      })
      .join("");
    if (a.title) {
      foodLabel.push(`
   
<li>
<div class="tab-box">
<h6>${a.title}</h6>
</div>
</li>
    `);
    }
    return `
    <div>
    <div class="d-flex mb-3 flex-wrap justify-content-between">
    <div class="col-lg-12    ">
    <img src="../img/wasafat/${a.img}.jfif" style="max-height: 300px;" alt="">
 
    </div>
   <div class="col-lg-6 mt-3">
   <h2> ${a.title}</h2>
   <p>${a.text}</p>
   </div>
  
   </div>

   ${wasafat}
    </div>
    `;
  });

window.onload = () => {
  document.getElementById("wasafatContent").innerHTML = foodCollection.join("");
  document.getElementById("wasafatLabels").innerHTML = foodLabel.join("");
};
