const foods = [
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
    {
        title: '',
        img:'',
        text: ``,
        ways: [
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
            {
                title: '',
                desc: '',
                img: ''
            },
        ]
    },
    // ==========================================
];


































const tiringResist  = [
    {
        title: ' الموز',
        desc: `الموز يحتوي على البوتاسيوم وفيتامين "بي" و"سي" وأحماض "أوميغا 3" الدهنية والألياف والكربوهيدرات، مما يساعدنا على مقاومة الجفاف وتخفيف أعراض التعب.`
    },
    {
        title: 'الشاي الأخضر',
        desc: `أما العلاج الطبيعي الأمثل للإجهاد والتعب المرتبطين بالعمل، فهو الشاي الأخضر لأنه يحتوي على مادة البوليفينول التي تساعد على تقليل التوتر وزيادة مستويات الطاقة وتحسين التركيز.`
    },
    {
        title: 'الماء',
        desc: `يتكون ثلثا جسم الإنسان من الماء، لذلك فإن الجفاف هو أحد الأسباب الرئيسية لنقص الطاقة والشعور بالإرهاق. وإذا لم يحصل الجسم على كمية كافية من الماء، فلن يكون لديه الطاقة الكافية للقيام بالمهام اليومية.`
    },
    {
        title: 'بذور اليقطين',
        desc: `بذور اليقطين مفيدة جدا لمقاومة الإرهاق، فهي غنية بالبروتينات وأحماض أوميغا 3 الدهنية وفيتامينات "بي1″ و"بي2″ و"بي5" و"بي6″، بالإضافة إلى احتوائها على المغنيسيوم والمنغنيز والحديد والفسفور. وتساعد هذه المغذيات على تحسين وحماية جهاز المناعة وتزوّدنا بالطاقة.`
    },
    {
        title: 'الزبادي',
        desc: `يعتبر الزبادي أحد الأطعمة الغنية بالبروتينات والكربوهيدرات، وهي مفيدة جدا في تقليل أعراض التعب. كما يساعد البروبيوتيك الموجود في الزبادي على التخفيف من أعراض التعب المزمن، وتحسين صحة الجهاز الهضمي.`
    },
    {
        title: 'البطيخ',
        desc: `يساعد البطيخ على توفير السوائل التي يحتاجها الجسم خاصة في فصل الصيف.
البطيخ غني بالماء والإلكتروليتات التي تساعد على تجنب الجفاف وتعزيز النشاط، كما يحتوي على عناصر غذائية مثل البوتاسيوم وفيتامين "سي" وبيتا كاروتين التي تساعد على مكافحة أعراض التعب.`
    },
    {
        title: 'الفلفل الأحمر',
        desc: `يعتبر الفلفل الأحمر مصدرا ممتازا لفيتامين "سي"، وبفضل خصائصه المضادة للأكسدة، فإنه يساعد على تعزيز المناعة.`
    },
    {
        title: 'البقوليات',
        desc: `توفر البقوليات العديد من الفوائد الصحية وتساعد على مكافحة الإرهاق بفضل ما تحتويه من ألياف وكربوهيدرات وبروتينات ومعادن، مثل البوتاسيوم والفوسفور والحديد والمغنيسيوم. وتعدّ البقوليات غذاء مثاليا لتزويد الجسم بالطاقة.`
    },
    {
        title: ' الجوز',
        desc: `الجوز هو أحد الأطعمة التي تساعد على محاربة التعب بفضل ما يحتويه من أحماض أوميغا 3 الدهنية، كما يمدنا الجوز بالطاقة ويساعد على التعافي واستعادة النشاط بعد التمارين الرياضية.`
    },
    {
        title: 'السبانخ',
        desc: `تعرف السبانخ بأنها غنية جدا بالحديد، وهو معدن يساعد الدم على نقل الأكسجين إلى خلايا الجسم، وبالتالي زيادة مستويات الطاقة ومكافحة التعب.`
    }
]




const heartDes = [
    {
        title: 'البروكلي',
        desc: `يعمل البروكلي على إزالة السموم الطبيعية من مجرى الدم في الجسم. ولأنه يحتوي على الألياف الصحية، فإن البروكلي يساعد جسمك على خفض ضغط الدم، وبالتالي يقلل من خطر تمزق الشرايين.`
    },
    {
        title: 'الجوز',
        desc: `الجوز غني بالمغنيسيوم. وأثبتت الدراسات أن المغنيسيوم يقلل من تراكم الترسبات في الشرايين. كما أن الجوز مليء بالأحماض الدهنية "أوميغا 3"، وهو عامل آخر في مكافحة تراكم الكوليسترول السيئ.`
    },
    {
        title: 'الحبوب الكاملة',
        desc: `توصي جمعية القلب الأميركية بخمس أو ست حصص من الحبوب الكاملة يوميا، فهي تقلل من الكولسترول السيئ وتحسن الكولسترول الجيد. ويعد الأرز البني أبر هذه الحبوب.`
    },
    {
        title: 'السبانخ',
        desc: `السبانخ غني بمادة البوتاسيوم، كما أنه يحتوي على الألياف. ويقول خبراء التغذية أن كمية قليلة من السبانخ بين الفترة والأخرى من شأنها أن تمنع انسداد الشرايين وأن تخفض ضغط الدم.`
    },
    {
        title: 'زيت الزيتون',
        desc: `يعد زيت الزيتون علاجا فعالا للمشكلات الناجمة عن الكولسترول السيئ، فهو غني بمضادات الأكسدة وأحماض الأولييك غير المشبعة، ويوفر نظاما صحيا للدورة الدموية`
    },
    {
        title: 'الكركم',
        desc: `يتألف الكركم بشكل رئيسي من الكركمين، ويتميز بكفاءته العالية في إصلاح تلف جدران الشريان، بسبب قدرته الفائقة على مقاومة الالتهابات. وأثبتت الدراسات نجاعة الكركم في منع الترسبات في الدم.`
    },
    {
        title: 'الأفوكادو',
        desc: `يمكن استخدام الأفوكادو عصيرا أو في العديد من الأطباق الأخرى، مثل السلطة. فهو يحسن الصحة العامة ويعمل على تقليل الكولسترول السيئ وكذلك يخفض ضغط الدم بسبب غناه بفيتامين E.`
    },
    {
        title: 'السمك',
        desc: `تناول السمك مرتين في الأسبوع يساعد على تقليل تراكم الترسبات في الشرايين، فالأحماض الدهنية الموجودة في سمك السلمون والتونة والسردين والماكريل، تساعد على تقليل مستويات الدهون الثلاثية، كما تعالج التهاب الأوعية الدموية.`
    },
    {
        title: 'البطيخ',
        desc: `يعتبر البطيخ الخيار الأفضل لرفد الجسم بأكسيد النيتريك، الذي ثبت علميا أنه يخفض ضغط الدم ويقلل الالتهابات ويحسن عمل الشرايين. وللبطيخ دور مهم في خفض الدهون في البطن.`
    },
    {
        title: 'الثوم',
        desc: `الثوم معروف بدوره الفعال في إذابة أي ترسبات في الأوعية الدموية، فهو يحارب إنزيما يعرف باسم الأنجيوتنسين الذي يضيق الأوعية الدموية.`


    }
]



const neg= [
    {
        title: 'الحبوب المكررة',
        desc: `لا تحتوي الحبوب المكررة، مثل: الأرز، والخبز، والمعكرونة والوجبات الخفيفة المصنوعة من الدقيق الأبيض على الألياف والفيتامينات والمعادن الصحية، إنما تتحول بسرعة إلى سكر يخزنه الجسم على شكل دهون
يجب استبدال هذه الأطعمة بالحبوب الكاملة، مثل:

الأرز البني.
الشوفان.
القمح الكامل.`
    },
    {
        title: 'الدهون غير الصحية',
        desc: `إذ يعد الحد من كمية الدهون المشبعة والمتحولة التي يتناولها مريض القلب يوميًا خطوة مهمة لـِ:

تقليل نسبة الكوليسترول في الدم.
تقليل خطر الإصابة بمرض الشريان التاجي إذ من الممكن أن يؤدي ارتفاع مستوى الكوليسترول في الدم إلى تصلب الشرايين.`
    },
    {
        title: 'الحد من السكر والملح والكربوهيدرات المكررة',
        desc: `يزيد تناول الكميات الكبيرة من الملح، والسكر، والكربوهيدرات المكررة من خطر الإصابة بنوبة قلبية أو سكتة دماغية.`
    },
    {
        title: 'اللحوم الحمراء والمصنعة',
        desc: `فبالرغم من أن اللحوم من الأطعمة الغنية بالبروتينات، والحديد، والزنك، وفيتامينات المجموعة ب الضرورية لصحة البدنية، لكنها تحتوي على كميات كبيرة من الكوليسترول، والأحماض الدهنية المشبعة التي تزيد بدورها من خطر زيادة أعراض مرض القلب. `
    },
    {
        title: 'البيتزا والمعجنات',
        desc: `يمكن أن تكون البيتزا صحية إذا حُضرت بالطريقة الصحيحة، لكن غالبًا ما تحتوي البيتزا المتناولة خارج المنزل والمعجنات على كميات كبيرة من الآتي:
الصوديوم.
الدهون.
السعرات الحرارية.
هذه العناصر الغذائية جميعها تزيد خطر الإصابة بنوبات قلبية.`
    },
    {
        title: 'الزبدة',
        desc: `إذ تُعد الزبدة من الأطعمة الغنية بالدهون المشبعة التي يمكن أن ترفع نسبة الكوليسترول الضار، وتزيد من احتمالية الإصابة بأمراض القلب. 
لذا من الأفضل استبدال الزبدة بزيت الزيتون أو الزيت النباتي الذي يحتوي على دهون أحادية غير مشبعة.`
    
}
]


const insideBody = [
    {
        title: 'أطعمة تغذي البشرة من الداخل',
        desc: `معجون الطماطم والبطيخ وثمر الورد أو الكركديه هي أغذية غنية بالليكوبين المضاد للأكسدة والذي يحارب الجذور الحرة في الجلد التي يسبهها التعرض لأشعة الشمس والتدخين. وتضم القامة أيضا أسماك البحر الدهنية مثل السلمون والماكريل والرنجة، التي توفد بروتيناً عالي الجودة للبشرة الجافة بالإضافة إلى أحماض أوميغا -3 الدهنية وفيتامين د والسيلينيوم التي تمنع الالتهاب.
        المكسرات و الأفوكادو والزيوت النباتية مثل زيت بذور الكتان والجوز وزيت اللفت وزيت الزيتون الأحماض الدهنية الأحادية غير المشبعة و التي تعزز بنية وتجديد الجلد. كما أنها تضمن نسبة كافية من أحماض أوميغا 3 إلى أوميغا 6 الدهنية الكافحة للالتهابات
        إذا تم معالجة أوجه القصور في النظام الغذائي يتوقف تساقط الشعر. من حيث التغذية والشعر الصحي     
        تأكد أن نظامك الغذائي يحتوي على الماغنيسيوم والبيوتين والزنك والحديد والفيتامينات، الأمر الذي يمكن أن يساعد في الحفاظ على قوة الشعر وحجمه الأمثل.        

        `
    },
    
    {
        title: 'الأحماض الدهنية الأساسية',
        desc: `فالأحماض الدهنية أوميغا 3 تغذي وتحمي الشعر، وتساعد في نموه، وتضيف لمعانًا ناعمًا، كما تحتوي الأسماك الدهنية مثل السلمون على الكثير من أوميغا 3 ، كما أن الجوز وبذور الشيا وبذور الكتان وفول الصويا مصادر جيدة لمغذيات الشعر.

        أيضا تساعد الفيتامينات على تكوين خلايا الدم الحمراء، التي تحمل الأكسجين والمواد الغذائية إلى فروة الرأس وبصيلات الشعر. كما يمكنك العثور على فيتامين بي 6 في الموز والبطاطس، و بي 12 في اللحوم ومنتجات الألبان، وحمض الفوليك في الحمضيات والطماطم.

        يحافظ فيتامين د على صحة الجلد والعظام والشعر. 
        يمكنك العثور على فيتامين د في الأسماك الدهنية والكبد وصفار البيض والأطعمة المدعمة مثل الحليب.
        `
    },
   
]





