const gym = [
  {
    alt: false,
    title: `تمرين الـchest press `,
    img: `1`,
    desc: `
        تمرين الـchest press : 
يعمل علي تمرين عضلات الصدر الرئيسية و عضلات التراي والكتفين 
طريقة تطبيق التمرين : 
1- اجلس علي مقعد ثم ضع يديك بحيث تكون خارج عرض الكتفين و بحيث يكون البار مباشرة أمام عينيك لكي لا تضطر الي سحبه من مكان بعيد فيسبب في إرهاق مفصل الكتف .
2- نتأكد من ضم عظمتي الكتف ( لوح الكتف ) الي الداخل ثم نضمهم علي بعض 
3 - قم بأخذ نفس عميق ثم اترك الوزن يستقر في الأعلي و تأكد من أن الظهر العلوي مشدوداً بعد رفعه .
3- استنشق ثم اسمح للبار بالنزول بشكل بطيء بفتح المرفقين .
4- قم بخفض البار في شكل خط مستقيم الي عظم القص ثم المس صدرك 
5- نقوم بدفع القضيب الحديدي الي الأعلي مع المحافظة علي قدميك علي الارض طول مدة التمرين لان هذا يحسن من رفعتك .
6- نكرر عدد التكرار المطلوب
        `,
  },
  {
    img: `1-alt`,
    alt: true,
    title: ` بديل تمرين الـ chest press في المنزل ( pushups)  `,
    desc: `
       

يعمل تمرين ضغط الصدر علي زيادة قوة الجزء العلوي من الجسم  و استهداف عضلات الترايسبس و الصدر و الأكتاف الأمامية 

طريقة تطبيق التمرين : 
1- قم بإبعاد قدميك عن الكتفين ثم قف علي طول ذراع بحيث تكون بعيدا عن المنضده
2- قم بوضع راحتيك علي تلك المنضدة في نفس الوقت الذي تميل فيه للامام في وضع لوح خشبي مستقيم و يجب أن يكون الذراعين بارتفاع الكتف و بعرض الكتفين
3-  خذ نفس عميق عند ثني المرفقين ثم حرك الجزء العلوي من الجسم بشكل بطيء تجاه المنضدة و إبقي قدميك مستقيمه علي الارض 
4- نتوقف لمدة ثانيتين
5- قم باستخدام ذراعيك في دفع الجسم ببطء الي نقطة البداية
        `,
  },
  {
    alt: false,
    title: `  تمرين الـdips ( المتوازي ) `,
    img: `2`,
    desc: `
      

 هو تمرين رائع للمبتدئين يعمل علي تضخيم عضلة الصدر من الأسفل.

طريقة أداء تمرين الـdips ( المتوازي) : 
1- قم بضبط الدبوس على الوزن الذي تريده و كلما كان الوزن ثقيل ، كلما زادت المساعدة التي يوفرها.
2- نقوم بتركيب آلة الرفع المساعده ، ونمسك القضبان بواسطة قبضة مائلة و يجب أن يعمل الشريط بشكل قطري خلال راحة اليد.
3- انحني للأمام قليلاً.
4- قم باستنشاق الهواء خلال ثني ذراعيك لكي تخفض جسمك ثم تشعر بتمدد بسيط في كتفيك أو صدرك.
5- خلال النزول ، اسمح للمرفقين بالتمدد قليلاً 
6- قُم بالزفير و إدفع جسمك مرة ثانية لوضع البداية.
كرر هذا التمرين العدد المحدد من التكرار.
        `,
  },
  {
    alt: true,
    title: ` بديل تمرين المتوازي ( chair dips) `,
    img: `2-alt`,
    desc: `
       

طريقة تطبيق التمرين : 
قم بالجلوس بظهرك في اتجاه بنش أفقي ثم ضع يديك علي البنش مباعداً بينهما بمسافة متساوية حتي عرض كتفيك و بحيث تكون القدمان ممدودتين بشكل تام أمامك على البنش الآخر و بحيث يكون جذعك في شكل زاوية قائمه مع رجليك و فخذيك 

2. نأخذ نفسا عميقا ثم نبدأ بإنزال الجسم نحو الأسفل بحيث تتكون زاوية أقل من 90 درجه بين الأجزاء العلويه من الذراعين و ساعديك .
 3- نبقي الكوعين مقاربين للجسم قدر المستطاع أثناء التمرين وبحيث يكون الساعدان متوجهين تجاه الأسفل  ثم ارفع نفسك تجاه الأعلي باستخدام عضلات الترايسبس حتي ترجع إلى وضع البداية مرة أخرى 
4- قم بتكرار التمرين عدد التكرارات المطلوب
        `,
  },

  {
    alt: false,
    title: `تمرين الـleg extension `,
    img: `3`,
    desc: `
        
يعمل هذا التمرين علي بناء الحجم والقوة في عضلة الكواد و يقوي الأربطة المتصلة بمفصل الركبة مما يساعد على منع الإصابة

 طريقة تطبيق التمرين :
1- اختر وزنك أولاً واجلس على الجهاز مع وضع ساقيك أسفل الوسادة (تتجه القدمان إلى الأمام) و تمسك اليدين بالقضبان الجانبية.
 نصيحة: ستحتاج إلى ضبط الوسادة بحيث تسقط فوق الجزء السفلي من ساقك (فوق قدميك مباشرة). 
2- تأكد أيضًا من أن ساقيك تشكلان زاوية 90 درجة بين أسفل الساق وأعلى رجلك. 
3- باستخدام عضلات الفخذ ، مد ساقيك إلى أقصى حد أثناء الزفير.  4- تأكد من بقاء باقي الجسم ثابتًا على المقعد. 
5- اخفض الوزن ببطء إلى الموضع الأصلي أثناء الشهيق ، مع التأكد من عدم تجاوز حد الزاوية البالغ 90 درجة.
6- كرر عدد التكرارات الموصي بها
        `,
  },
  {
    alt: true,
    title: ` بديل تمرين ال leg extension `,
    img: `3-alt`,
    desc: `
       

طريقة التطبيق 
1 - ابدأ بالجلوس بشكل مستقيم على كرسي.  2- اجلس مع الجزء العلوي من جسمك بشكل مستقيم على ظهر الكرسي.  
3- حافظ على كتفيك للخلف وانظر للأمام ورأسك في وضع محايد.  4- ضع يديك على جانبيك وأرحهما على مقعد الكرسي أو الذراعين للحصول على الدعم.
5- اجلس مع المباعدة بين الركبتين والكاحلين بمقدار عرض الورك ، وثني ركبتيك بزاوية 90 درجة 
6- حافظ على استواء قدميك على الأرض.
 7- تأكد من أن كرسيك يسمح لك بثني ركبتيك بزاوية 90 درجة.  إذا تم ثنيهما بزاوية أصغر ولم يتم محاذاته بشكل مستقيم فوق كاحلك ، فقد تضع ضغطًا إضافيًا على مفاصلك.
8- ارفع النصف السفلي من ساقيك بحيث تكون على نفس الخط مع فخذيك.  استنشق ، ثم ازفر بينما تقوِّم ركبتيك وترفع ساقيك.
 9- اجلب ساقك وأصابع قدمك نحو السقف بحيث تكون متوازية مع فخذيك والأرض. 
10-  تأكد من استخدام حركات ثابتة وبطيئة بدلاً من تأرجح ركبتيك أو استخدام الزخم لتحريك ساقيك السفلية لأعلى.
11- أنزلهم إلى وضع البداية.
بعد إبقاء ساقيك مرفوعتين لمدة ثانية ، استنشق وأنت تحني ركبتيك ببطء.  و باستخدام حركات ثابتة ، أنزل قدميك حتى تصبح مسطحة مرة أخرى على الأرض. 
 من وضع البداية مع وضع قدميك على الأرض ، قم بالزفير وكرر الخطوات لأداء التمرين 
12 - قم بعمل 3 مجموعات من 10 تمديدات للساق. 
استرح لمدة 30 إلى 60 ثانية بين كل مجموعة.
        `,
  },
  {
    alt: false,
    title: ` تمرين الـ Hip adduction `,
    img: `5`,
    desc: `
       
يعمل ها التمرين علي تعزيز التوازن بشكل عام و دعم الحركة و تحسين القوة الوظيفية والثبات و المحافظة على جسمك في وضع مستقيم حتى تتمكن من الحركة بأمان وراحة. 
و يمكن أن يساعد تمرين هذه العضلات الصغيرة في تعزيز القوة والاستقرار في جميع أنحاء جسمك سواء كنت ترفع الأثقال أو الجري أو حتى الوقوف في مكانك.
طريقة تطبيق التمرين : 1- أثناء الجلوس على الآلة ، اجلس و افرد رجليك مع وضع الركبتين على منصات. 2- اضغط على رجليك معًا وحررهما ببطء.
3- كرر التمرين عدد 3 مجموعات و 10 تكرارات لكل مجموعة .
        `,
  },
  {
    alt: true,
    title: `    بديل الـ adduction `,
    img: `5-alt`,
    desc: `
    

طريقة تطبيق التمرين :
 1- ابدأ في وضع اللوح الخشبي الجانبي بكوع واحد على الأرض أو وسادة وساقيك متعامدة مع مقعد الأثقال أو قطعة مماثلة من المعدات.
2- ضع رجلك العلوية على المقعد مع ثني ركبتك قليلاً ، مع إبقاء ساقك السفلية مستقيمة أسفل المقعد. 
3- كلما استقرت على رجلك العلوية على المقعد ، زادت ثباتك (وخطر إصابة الفخذ أقل).
 إذا وضعت كاحلك فقط على المقعد ، فسيكون هذا التمرين صعبًا للغاية.
4- قم بشد عضلات قدمك العلوية لتحمل وزن جسمك ، ثم ارفع ساقك السفلية ببطء حتى تلامس الجانب السفلي من المقعد.
5- أنزِل جسمك تدريجيًا إلى وضع البداية.
6- بمجرد الانتهاء من التمرينات المرغوبة لتلك الساق ، اقلب واعمل على المقربين للساق الأخرى.
7- كرر للعدد المطلوب من المجموعات لكل ساق .
 اجعل هدفك هو 2-3 مجموعات من 10-12 ممثلين .
        `,
  },
  {
    alt: false,
    title: `تمرين الـ abduction `,
    img: `6`,
    desc: `
        
يعمل هذا التمرين علي تقوية الوركين و الفخذين الداخليين و الخارجيين و تقوية عضلات المؤخرة و تثبيت عضلات الحوض.

كيفية تطبيق التمرين :
1- قم بالإعداد في وضع مستقيم مع وضع ظهرك على الوسادة وعمودك الفقري محايدًا.
2- قم بالزفير وادفع الساقين بعيدًا أثناء فتح الوسادات.
3-  بمجرد تدوير الوركين بالكامل من الخارج ، عد ببطء إلى وضع البداية.

4- كرر الرقم المطلوب من التكرارات
        `,
  },
  {
    alt: true,
    title: `  بديل تمرين ال abduction`,
    img: `6-alt`,
    desc: `
      

طريقة تطبيق التمرين : 
1- قم بتطبيق من 1  الي 3 مجموعات من 10 إلى 15 تكرارًا على كل جانب. 
2- إذا كنت ترغب 
في زيادة التحدي ، يمكنك وضع رباط مقاومة حول فخذيك أو حمل وزن على الجزء الخارجي من أعلى الفخذ.
        `,
  },
];

const workouts = [
  {
    title: "Hollow Hold",
    img: "1",
    desc: `
        في البداية استلق على الظهر مع تمديد الذراعين والساقين على الأرض، ثم رفعهما مع إبقاء خط حمالة الصدر وأسفل الظهر فقط على السجادة إلى أن يبدو الجسم كشكل الموز، استمر هكذا لمدة 30 إلى 60 ثانية ثم انزل لأسفل مع تكرار تلك الخطوة.
        `,
  },
  {
    title: "Side Plank",
    img: "2",
    desc: `
        يتم القيام بهذا التمارين عن طريق الاستلقاء على الجانب الأيمن مع القدم اليسرى أعلى اليمين، وأصابع القدم والكعب مبطنة، والساعد الأيمن على الأرض، أما الكوع فيكون تحت الكتف مع فتح الأصابع، واليد اليسرى فوق الورك، ثم رفع الوركين لأعلى حتى يكون الجسم خطًا مستقيمًا من الرأس إلى الكعبين، والاستمرار لمدة 20 ثانية، يتم التكرار على الجانب الآخر.
        `,
  },
  {
    title: "V-Up",
    img: "3",
    desc: `
        للقيام بهذا التمرين يتم الاستلقاء على الظهر مع تمديد الساقين والذراعين على الجانبين، وكلاهما على الأرض، وفي حركة واحدة يتم رفع الجزء العلوي من الجسم والذراعين والساقين  حتى يتم التتوازن على عظم الذنب، وتكوين شكل حرف “V” من الجسم، أما الجزء السفلي من الجسم يتراجع، ومن الأفضل القيام بأداء أكبر عدد ممكن من التكرارات في مدة 45 ثانية، ثم الاستراحة لمدة 15 ثانية وبعد هذا القيام بالتمارين التالية.
        `,
  },
  {
    title: "Bicycle Crunch",
    img: "4",
    desc: `
        يتم القيام بهذا التمارين من خلال الاستلقاء على الظهر ووضع اليدين خلف الرأس، وشفرات الكتف مرفوعة عن الأرض، مع رفع الساقين وثنيها بزاوية 90 درجة، وبعد ذلك يتم القيام بتشغيل عضلات البطن من خلال تدوير الكوع الأيمن باتجاه الركبة اليسرى مع مد الساق اليمنى إلى الهواء بصورة مستقيمة، ثم الرجوع إلى البداية والتكرار على الجانب الآخر، ومن الأفضل الوصول إلى 30 عدة مع تبديل الجانبين.
        `,
  },
  {
    title: "Hip Rotation",
    img: "5",
    desc: `
        يتم الاستلقاء على الأرض مع المحافظة على التباعد بين القدمين، ثم دفع ساق واحدة ببطء، والنظر للأمام ثم سحبها إلى الخلف، ثم يتم رفع الساق الأخرى وفعل الشيء ذاته بمنتهى البساطة، إذ أنه من تمارين الشد الرائعة في تقوية عضلات الفخذين وتحسين المرونة.
        `,
  },
  {
    title: "Squats",
    img: "6",
    desc: `
        القرفصاء من أكثر التمارين فعالية لتقوية الفخذين والوركين والأعقاب، ويوجد الكثير من الاختلافات التي توجد بتمرين القرفصاء، ولذا حافظ على الكتفين والصدر إلى أعلى مع أن يكون الظهر مستقيم وكذلك القدمين على نطاق أوسع (اعتبارًا من عرض الكتفين)، مع أخذ الوركين للوراء ثم ثني الركبتين والجلوس كالجلوس على الكرسي بالضبط، ثم الرجوع ببطء إلى الموضع الأصلي والتكرار، وتأكد من النظر بصورة مستقيمة خلال القرفصاء، وفي حال بدأ الظهر أو الرقبة يؤلمان فهذا دليل على عدم فعلها بشكل صحيح.
وبعد هذا يتم أخذ قسط من الراحة ثم البدء من جديد، والقيام بعمل مجموعات أقل من 2 إلى 3 مع 8 أو 10 مرات فقط، والقرفصاء تقوم بتحسين الصحة العامة عن طريق تعزيز الهضم والدورة الدموية.
        `,
  },
  {
    title: "Single Leg Stand",
    img: "7",
    desc: `
        إن التوازن على قدم واحدة يقوم بتعزيز مرونة عضلات الساق وكذلك تحسين التركيز مما يعمل على محاربة القلق والاكتئاب، وللبدء في التمرين قم بتحويل وزن الجسم كاملًا على قدم واحدة مع رفع الأخرى بعض الشئ عن الأرض، ثم جعله مستقيمًا إلى الأمام وحاول ألا يميل الجسم، ابق في تلك الوضعية لدقيقة، ومن الممكن كذلك القيام بأحد أوضاع اليوجا التي تسمى فريكشاسانا (vrikshasana) وهي تعمل على استرخاء وتهدئة الجهاز العصبي المركزي.
        `,
  },
  {
    title: "Plank",
    img: "8",
    desc: `
        إن تمرين البلانك يجعل الجسم بالكامل في العمل، وهو أكثر التمارين أهمية من أجل عضلات البطن، ولذا يتم النزول على الأرض على المرفقين وأصابع القدمين، وينبغي أن ينثني المرفقان وأسفل الكتفين مباشرة، مع المحافظة على الجسم مستقيماً والتمسك بالوضعية.
        `,
  },
  {
    title: "Jumping Jacks",
    img: "9",
    desc: `
        هذا التمارين من التمارينات الأساسية حيث يتم البدء به، ومن الهام أن يتم الإحماء والإطالة قبل بداية التمرين المنتظم، ويمنح Jumping Jacks المرونة كما يساعد على زيادة المقدرة على التحمل، ويمكن القيام به من خلال المحافظة على القدمين معًا والوقوف مع إبقاء اليدين مستقيمتين على الجانبين، وخلال القفز يتم رفع الذراعين فوق الرأس والقدمين على الجانبين، ثم العودة سريعًا إلى وضعية الوقوف بالقفزة، ومن الممكن عند القيام بتمارين القفز حوالي دقيقة أو دقيقتين أن ترتخي العضلات مع تدفق كمية أكبر من الأكسجين إلى مجرى الدم، كما أنها تحرق عدد من السعرات الحرارية، والحصول على جسد مرن ومتناسق مع فترة من تمارين القفز كل يوم.
        `,
  },
  {
    title: "Push-ups",
    img: "10",
    desc: `
        هو أحد أكثر التمارين التي يتم القيام بها في البيت وتكون فعاليتها كبيرة كما أنها شائعة جدًا، ومن اليسير للغاية أن يتم إجراؤها، وذلك عن طريق الدخول في وضعية اللوح الخشبي مع إبقاء اليدين أسفل الكتف بقليل، والمحافظة على الساقين مشدودتين، وإنزال الجسم إلى أن يقترب الصدر من الأرض وسرعان ما يتم العودة إلى الوضعية الأصلية، وهو يعمل على تقوية الجزء العلوي من الجسم بصورة أساسية لأنه يُفيد الصدر والكتفين والعضلة ثلاثية الرؤوس، وكذلك يقوم بتقوية الفخذين وعضلات البطن، وفي بداية الأمر يكون من العسير القيام بأعداد أكبر من تمارين الضغط، ومن الممكن البدء بأداء تمارين الضغط على الركبة وتمارين الضغط المائلة أولًا.
        `,
  },
  {
    title: "Crunches",
    img: "11",
    desc: `
        من أكثر التمارين التقليدية التي تمنح بطن أقوى من خلال الاستلقاء على الظهر مع ثني الركبتين ووضع الأقدام على الأرض مع المحافظة على تباعد القدمين، وينبغي إبقاء اليدين عند قاعدة الرأس مع توجيه المرفقين، ثم رفع الرأس والكتفين عن الأرض عن طريق استخدام عضلات البطن ثم العودة إلى الوضع مع التحكم.
        `,
  },
];

const gymHtml = gym.map((e, i) => {
  return `
    <div class="row g-0 justify-content-center mb-1-6 mb-md-2-2 mb-xl-2-8">
  
    <div class="col-md-12">
   
        <div
            class="card border-0 border-end-radius-10 border-start-sm-radius-10 h-100 box-shadow-style1">
            <div class="card-body p-1-9 p-lg-2-5">
          
                <div class="schedule-tag"> 
                ${e.alt? 'بديل في المنزل' : 'في الجيم'}
                </div>
                <h3 class="h4 mb-3">${e.title}</h3>
                <div class="shadow-sm p-2 d-inline-block">
                    <img src="../img/excersises/${e.img}.jpg" class="w-auto " style="height: 200px" alt="" />
                </div>
                <p style="white-space:pre-line"
                    class="">
                    ${e.desc}</p>
                
            </div>
        </div>
    </div>
</div>
    `;
});
const workoutsHtml = workouts.map((e, i) => {
  return `
    <div class="row g-0 justify-content-center mb-1-6 mb-md-2-2 mb-xl-2-8">
  
    <div class="col-md-12">
   
        <div
            class="card border-0 border-end-radius-10 border-start-sm-radius-10 h-100 box-shadow-style1">
            <div class="card-body p-1-9 p-lg-2-5">
          
                <div class="schedule-tag"> 
                  تمرين منزلي
                </div>
                <h3 class="h4 mb-3">${e.title}</h3>
                <div class="shadow-sm p-2 d-inline-block">
                    <img src="../img/workouts/${e.img}.jpg" class="w-auto " style="height: 200px" alt="" />
                </div>
                <p style="white-space:pre-line"
                    class="">
                    ${e.desc}</p>
                
            </div>
        </div>
    </div>
</div>
    `;
});



window.onload = () => {
  document.getElementById("gymEx").innerHTML = gymHtml;
  document.getElementById("workoutsEx").innerHTML = workoutsHtml;
  // sections background image from data background
  var pageSection = $(".parallax,.bg-img");
  pageSection.each(function (indx) {
    if ($(this).attr("data-background")) {
      $(this).css(
        "background-image",
        "url(" + $(this).data("background") + ")"
      );
    }
  });
};
