const books = [
    {
        title: 'الرجل الذي حسب زوجته قبعة',
        desc: `الرجل الذي حسب زوجته قبعة لـ أوليفر ساكس الرجل الذي حسب زوجته قبعة هو من ضمن أخر كتب عن الصحة النفسية، من تأليف أوليفر ساكس طبيب أعصاب بريطاني كان يؤمن بأن العقل هو أكثر شيء مدهش في العالم، وظهر ذلك من خلال كتاباته التي اشتهرت بدراسة حالات الأفراد الذين يعانون من خلل أو اضطراب في أدمغتهم.
يأخذك الكتاب في رحلة لواقع آخر غريب غير واقعنا الاعتيادي، نبحر داخل عوالم أشخاص أصيبوا بخلل في أدمغتهم جعلهم ينظرون إلى العالم بطريقة مختلفة.
ستجد قصصاً غرببة ومختلفة، مثل الرجل الذي يظن نفسه كلباً، أو التوأم الذي يملك قدرة خارفة على القيام بالعمليات الحسابية بسرعة خيالية، أو السيدة العجوز التي ترصد حركات المارة وتضخمها حتى تصبح مرعبة ومخيفة، وغيرها الكثير.
يؤكد دكتور أوليفر في كتابه على العلاقة المركبة بين الحسد والعقل والذهن، ويوضح أن ما يشكل الإنسان هو توحد هذه العناصر، لذلك يرى الكاتب أن علاج الجسد لا ينبغي أن يكون بمعزل عن العقل والروح.`,
        img: '1'
    },
    {
        title: 'علاقات خطيرة',
        desc: `الكتاب من تأليف الدكتور محمد طه، استشاري الطب النفسي بكلية الطب بجامعة المنيا، وهو من الكتب المهمة في فهم الكثير من الاضطرابات والأزمات النفسية التي يمر بها الإنسان

بالإضافة إلى عرض 30 علاقة إنسانية، يشرح الكاتب مدى خطورتها على النفس الإنسانية السوية. ميزة الكتاب الحقيقية هي أنه راعى خصوصية المجتمع المصري
فشرح الأمراض النفسية بشكل يواكب التطورات التي يشهدها المجتمع، ولم يقدم تلك الأمراض بشكل عام.`,
        img: '2'
    },
    {
        title: 'الأمراض النفسية والعقلية والاضطرابات السلوكية عند الأطفال',
        desc: `ألَّف الكتاب الدكتور عبد المجيد الخليدي، الأمين العام المساعد السابق للأطباء النفسيين العرب سابقًا، بالاشتراك مع الدكتور كمال حسن وهبي باحث وأستاذ جامعي.
على الرغم من أن الكتاب يحاول شرح أهم الأمراض النفسية والعقلية التي يمكن أن تصيب الأطفال، من خلال تقديم مراحل نمو الطفل، والاحتياجات النفسية المطلوبة، بالإضافة إلى الصراع النفسي والاضطرابات السلوكية
فإن ميزته أنه يقدم فصلاً كاملاً لشرح علم النفس ومبادئه وعلاقته بالعلوم الأخرى، وكذلك مفهوم الصحة النفسية وأهميتها في الحياة وكيفية تحقيقها، وهو ما يعد مناسبًا للكبار قبل الصغار.`,
        img: '3'
    },
    {
        title: 'الكتاب الأحمر',
        desc: `كتاب الكتاب الأحمر من تأليف الطبيب والمعالج النفسي كارل غوستاف يونج، جعل هذا الكتاب مختلفاً عن غيره هو أنه لم يطرح مشكلة أو حلا لمشكلة، ولم يقدم محاضرة ولا عظة يمكن للقارئ أن يتبناها أو يعمل عليها لحل مشكلته، وإنما قام بدراسة معمقة على نفسه واعتبرها طريقا خاصا به، لم يتبع عبرها شخصا آخر، ولا ينصح أحداً بان يتبعه عبرها، بل يمكن للمرء من خلالها أن يراقب ويرى ويخلق طريقه الخاص بنفسه ولنفسه، لكن ما انتهى إليه في نهاية المطاف، هو أن الحياة تقوم على المتناقضات، وأن فيها الأبيض والأسود، والعيش والموت، والخير والشر، وان الإنسان مخلوق على هذا الاساس وليس عليه أن يقبل أن السواد والشر والموت أمور موجودة فيه فقط، بل أن يحبها ويتعامل معها كما يتعامل مع نقيضها. `,
        img: '4'
    },
    {
        title: 'أسرار النفس والعقل الباطن',
        desc: `لم يعتمد سلامة موسى فى مؤلفه على نظريات غربية فى علم النفس  إنما اعتمد على الشخصية العربية وتداعياتها النفسية، فقام بنفسه بالتأليف والتحليل فى ماهية العقل الباطن وأسراره بما يتوافق مع النفسية العربية، حيث وجد في التأليف مساعدة للقارئ العربي على الفهم أكثر`,
        img: '5'
    },
    {
        title: 'كن أنت',
        desc: `لابد للإنسان أن يكون في تحرك وتطور مستمرين ، وأن يساعد نفسه على اتخاذ القرارات ، ولا يقول لم يعد هناك وقت ، أو يقول لقد كبرت على أن أحدث تغييراً بحياتي . ومن أهم جوانب الشخصية التي هي في أمس الحاجة إلى الوقوف معها لاستدراك ما بها من قصور أو خلل الجزء المتعلق بالثقة ... ذلك لأن الإنسان إذا افتقد الثقة في نفسه فإنه لن يستطيع أن يحقق أي إنجاز ، وسيكون وجوده في الحياة بلا قيمة فحول المفهوم الذاتي ، والمثل الأعلى ، والصورة الذاتية ، والتقدير الذاتي ، والإنجازات الذاتية وغيرها`,
        img: '6'
    },
   
];



const booksHTML = books.map((e, i) => {
    return `
    <div  class="w-50 mt-2-9 float-${i%3!==0? 'start' : 'end'}">
    <article class="card card-style4">
        <div class="image-box text-end">
            <img style="max-height: 200px" src="../img/psycho-books/${e.img}.jpg" class="border-radius-10" alt="...">
            <div style="max-width: 50%;line-height: 1.3;" class="blog-date rounded-3">
            ${e.title}
            </div>
        </div>
        <div class="card-body border-radius-10">
         
            <h3 class="mb-3 h4"><a href="blog-details.html"></a></h3>
            <p style="white-space:pre-line">
            ${e.desc}
            </p>
        </div>
    </article>
</div>
   
        `;
  });

window.onload = () => {
    if(document.getElementById("booksWrapper")){
      document.getElementById("booksWrapper").innerHTML = booksHTML.join("");
    }
   
 
  };
  